{
  "address": "0x73c02c2a07fe2929b4da5aa5f299b5c6ea94e979",
  "net": {
    "id": "31",
    "name": "RSK Testnet"
  },
  "name": "RelayHub",
  "settings": {
    "optimizer": {
      "enabled": false,
      "runs": 200
    },
    "evmVersion": "petersburg"
  },
  "version": "0.5.10+commit.5a6ea5b1",
  "source": "// File: contracts/IRelayHub.sol\n\npragma solidity ^0.5.5;\n\ncontract IRelayHub {\n    // Relay management\n\n    // Add stake to a relay and sets its unstakeDelay.\n    // If the relay does not exist, it is created, and the caller\n    // of this function becomes its owner. If the relay already exists, only the owner can call this function. A relay\n    // cannot be its own owner.\n    // All Ether in this function call will be added to the relay's stake.\n    // Its unstake delay will be assigned to unstakeDelay, but the new value must be greater or equal to the current one.\n    // Emits a Staked event.\n    function stake(address relayaddr, uint256 unstakeDelay) external payable;\n\n    // Emited when a relay's stake or unstakeDelay are increased\n    event Staked(address indexed relay, uint256 stake, uint256 unstakeDelay);\n\n    // Registers the caller as a relay.\n    // The relay must be staked for, and not be a contract (i.e. this function must be called directly from an EOA).\n    // Emits a RelayAdded event.\n    // This function can be called multiple times, emitting new RelayAdded events. Note that the received transactionFee\n    // is not enforced by relayCall.\n    function registerRelay(uint256 transactionFee, string memory url) public;\n\n    // Emitted when a relay is registered or re-registerd. Looking at these events (and filtering out RelayRemoved\n    // events) lets a client discover the list of available relays.\n    event RelayAdded(address indexed relay, address indexed owner, uint256 transactionFee, uint256 stake, uint256 unstakeDelay, string url);\n\n    // Removes (deregisters) a relay. Unregistered (but staked for) relays can also be removed. Can only be called by\n    // the owner of the relay. After the relay's unstakeDelay has elapsed, unstake will be callable.\n    // Emits a RelayRemoved event.\n    function removeRelayByOwner(address relay) public;\n\n    // Emitted when a relay is removed (deregistered). unstakeTime is the time when unstake will be callable.\n    event RelayRemoved(address indexed relay, uint256 unstakeTime);\n\n    // Deletes the relay from the system, and gives back its stake to the owner. Can only be called by the relay owner,\n    // after unstakeDelay has elapsed since removeRelayByOwner was called.\n    // Emits an Unstaked event.\n    function unstake(address relay) public;\n\n    // Emitted when a relay is unstaked for, including the returned stake.\n    event Unstaked(address indexed relay, uint256 stake);\n\n    // States a relay can be in\n    enum RelayState {\n        Unknown, // The relay is unknown to the system: it has never been staked for\n        Staked, // The relay has been staked for, but it is not yet active\n        Registered, // The relay has registered itself, and is active (can relay calls)\n        Removed    // The relay has been removed by its owner and can no longer relay calls. It must wait for its unstakeDelay to elapse before it can unstake\n    }\n\n    // Returns a relay's status. Note that relays can be deleted when unstaked or penalized.\n    function getRelay(address relay) external view returns (uint256 totalStake, uint256 unstakeDelay, uint256 unstakeTime, address payable owner, RelayState state);\n\n    // Balance management\n\n    // Deposits ether for a contract, so that it can receive (and pay for) relayed transactions. Unused balance can only\n    // be withdrawn by the contract itself, by callingn withdraw.\n    // Emits a Deposited event.\n    function depositFor(address target) public payable;\n\n    // Emitted when depositFor is called, including the amount and account that was funded.\n    event Deposited(address indexed recipient, address indexed from, uint256 amount);\n\n    // Returns an account's deposits. These can be either a contnract's funds, or a relay owner's revenue.\n    function balanceOf(address target) external view returns (uint256);\n\n    // Withdraws from an account's balance, sending it back to it. Relay owners call this to retrieve their revenue, and\n    // contracts can also use it to reduce their funding.\n    // Emits a Withdrawn event.\n    function withdraw(uint256 amount) public;\n\n    // Emitted when an account withdraws funds from RelayHub.\n    event Withdrawn(address indexed dest, uint256 amount);\n\n    // Relaying\n\n    // Check if the RelayHub will accept a relayed operation. Multiple things must be true for this to happen:\n    //  - all arguments must be signed for by the sender (from)\n    //  - the sender's nonce must be the current one\n    //  - the recipient must accept this transaction (via acceptRelayedCall)\n    // Returns a PreconditionCheck value (OK when the transaction can be relayed), or a recipient-specific error code if\n    // it returns one in acceptRelayedCall.\n    function canRelay(\n        address relay,\n        address from,\n        address to,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    ) public view returns (uint256 status, bytes memory recipientContext);\n\n    // Preconditions for relaying, checked by canRelay and returned as the corresponding numeric values.\n    enum PreconditionCheck {\n        OK,                         // All checks passed, the call can be relayed\n        WrongSignature,             // The transaction to relay is not signed by requested sender\n        WrongNonce,                 // The provided nonce has already been used by the sender\n        AcceptRelayedCallReverted,  // The recipient rejected this call via acceptRelayedCall\n        InvalidRecipientStatusCode  // The recipient returned an invalid (reserved) status code\n    }\n\n    // Relays a transaction. For this to suceed, multiple conditions must be met:\n    //  - canRelay must return PreconditionCheck.OK\n    //  - the sender must be a registered relay\n    //  - the transaction's gas price must be larger or equal to the one that was requested by the sender\n    //  - the transaction must have enough gas to not run out of gas if all internal transactions (calls to the\n    // recipient) use all gas available to them\n    //  - the recipient must have enough balance to pay the relay for the worst-case scenario (i.e. when all gas is\n    // spent)\n    //\n    // If all conditions are met, the call will be relayed and the recipient charged. preRelayedCall, the encoded\n    // function and postRelayedCall will be called in order.\n    //\n    // Arguments:\n    //  - from: the client originating the request\n    //  - recipient: the target IRelayRecipient contract\n    //  - encodedFunction: the function call to relay, including data\n    //  - transactionFee: fee (%) the relay takes over actual gas cost\n    //  - gasPrice: gas price the client is willing to pay\n    //  - gasLimit: gas to forward when calling the encoded function\n    //  - nonce: client's nonce\n    //  - signature: client's signature over all previous params, plus the relay and RelayHub addresses\n    //  - approvalData: dapp-specific data forwared to acceptRelayedCall. This value is *not* verified by the Hub, but\n    //    it still can be used for e.g. a signature.\n    //\n    // Emits a TransactionRelayed event.\n    function relayCall(\n        address from,\n        address to,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    ) public;\n\n    // Emitted when an attempt to relay a call failed. This can happen due to incorrect relayCall arguments, or the\n    // recipient not accepting the relayed call. The actual relayed call was not executed, and the recipient not charged.\n    // The reason field contains an error code: values 1-10 correspond to PreconditionCheck entries, and values over 10\n    // are custom recipient error codes returned from acceptRelayedCall.\n    event CanRelayFailed(address indexed relay, address indexed from, address indexed to, bytes4 selector, uint256 reason);\n\n    // Emitted when a transaction is relayed. Note that the actual encoded function might be reverted: this will be\n    // indicated in the status field.\n    // Useful when monitoring a relay's operation and relayed calls to a contract.\n    // Charge is the ether value deducted from the recipient's balance, paid to the relay's owner.\n    event TransactionRelayed(address indexed relay, address indexed from, address indexed to, bytes4 selector, RelayCallStatus status, uint256 charge);\n\n    // Reason error codes for the TransactionRelayed event\n    enum RelayCallStatus {\n        OK,                      // The transaction was successfully relayed and execution successful - never included in the event\n        RelayedCallFailed,       // The transaction was relayed, but the relayed call failed\n        PreRelayedFailed,        // The transaction was not relayed due to preRelatedCall reverting\n        PostRelayedFailed,       // The transaction was relayed and reverted due to postRelatedCall reverting\n        RecipientBalanceChanged  // The transaction was relayed and reverted due to the recipient's balance changing\n    }\n\n    // Returns how much gas should be forwarded to a call to relayCall, in order to relay a transaction that will spend\n    // up to relayedCallStipend gas.\n    function requiredGas(uint256 relayedCallStipend) public view returns (uint256);\n\n    // Returns the maximum recipient charge, given the amount of gas forwarded, gas price and relay fee.\n    function maxPossibleCharge(uint256 relayedCallStipend, uint256 gasPrice, uint256 transactionFee) public view returns (uint256);\n\n    // Relay penalization. Any account can penalize relays, removing them from the system immediately, and rewarding the\n    // reporter with half of the relay's stake. The other half is burned so that, even if the relay penalizes itself, it\n    // still loses half of its stake.\n\n    // Penalize a relay that signed two transactions using the same nonce (making only the first one valid) and\n    // different data (gas price, gas limit, etc. may be different). The (unsigned) transaction data and signature for\n    // both transactions must be provided.\n    function penalizeRepeatedNonce(bytes memory unsignedTx1, bytes memory signature1, bytes memory unsignedTx2, bytes memory signature2) public;\n\n    // Penalize a relay that sent a transaction that didn't target RelayHub's registerRelay or relayCall.\n    function penalizeIllegalTransaction(bytes memory unsignedTx, bytes memory signature) public;\n\n    event Penalized(address indexed relay, address sender, uint256 amount);\n\n    function getNonce(address from) view external returns (uint256);\n}\n\n// File: contracts/IRelayRecipient.sol\n\npragma solidity ^0.5.5;\n\ncontract IRelayRecipient {\n\n    /**\n     * return the relayHub of this contract.\n     */\n    function getHubAddr() public view returns (address);\n\n    /**\n     * return the contract's balance on the RelayHub.\n     * can be used to determine if the contract can pay for incoming calls,\n     * before making any.\n     */\n    function getRecipientBalance() public view returns (uint);\n\n    /*\n     * Called by Relay (and RelayHub), to validate if this recipient accepts this call.\n     * Note: Accepting this call means paying for the tx whether the relayed call reverted or not.\n     *\n     *  @return \"0\" if the the contract is willing to accept the charges from this sender, for this function call.\n     *      any other value is a failure. actual value is for diagnostics only.\n     *      ** Note: values below 10 are reserved by canRelay\n\n     *  @param relay the relay that attempts to relay this function call.\n     *          the contract may restrict some encoded functions to specific known relays.\n     *  @param from the sender (signer) of this function call.\n     *  @param encodedFunction the encoded function call (without any ethereum signature).\n     *          the contract may check the method-id for valid methods\n     *  @param gasPrice - the gas price for this transaction\n     *  @param transactionFee - the relay compensation (in %) for this transaction\n     *  @param signature - sender's signature over all parameters except approvalData\n     *  @param approvalData - extra dapp-specific data (e.g. signature from trusted party)\n     */\n     function acceptRelayedCall(\n        address relay,\n        address from,\n        bytes calldata encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes calldata approvalData,\n        uint256 maxPossibleCharge\n    )\n    external\n    view\n    returns (uint256, bytes memory);\n\n    /*\n     * modifier to be used by recipients as access control protection for preRelayedCall & postRelayedCall\n     */\n    modifier relayHubOnly() {\n        require(msg.sender == getHubAddr(),\"Function can only be called by RelayHub\");\n        _;\n    }\n\n    /** this method is called before the actual relayed function call.\n     * It may be used to charge the caller before (in conjuction with refunding him later in postRelayedCall for example).\n     * the method is given all parameters of acceptRelayedCall and actual used gas.\n     *\n     *\n     *** NOTICE: if this method modifies the contract's state, it must be protected with access control i.e. require msg.sender == getHubAddr()\n     *\n     *\n     * Revert in this functions causes a revert of the client's relayed call but not in the entire transaction\n     * (that is, the relay will still get compensated)\n     */\n    function preRelayedCall(bytes calldata context) external returns (bytes32);\n\n    /** this method is called after the actual relayed function call.\n     * It may be used to record the transaction (e.g. charge the caller by some contract logic) for this call.\n     * the method is given all parameters of acceptRelayedCall, and also the success/failure status and actual used gas.\n     *\n     *\n     *** NOTICE: if this method modifies the contract's state, it must be protected with access control i.e. require msg.sender == getHubAddr()\n     *\n     *\n     * @param success - true if the relayed call succeeded, false if it reverted\n     * @param actualCharge - estimation of how much the recipient will be charged. This information may be used to perform local booking and\n     *   charge the sender for this call (e.g. in tokens).\n     * @param preRetVal - preRelayedCall() return value passed back to the recipient\n     *\n     * Revert in this functions causes a revert of the client's relayed call but not in the entire transaction\n     * (that is, the relay will still get compensated)\n     */\n    function postRelayedCall(bytes calldata context, bool success, uint actualCharge, bytes32 preRetVal) external;\n\n}\n\n// File: @0x/contracts-utils/contracts/src/LibBytes.sol\n\n/*\n\n  Copyright 2018 ZeroEx Intl.\n\n  Licensed under the Apache License, Version 2.0 (the \"License\");\n  you may not use this file except in compliance with the License.\n  You may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\n  Unless required by applicable law or agreed to in writing, software\n  distributed under the License is distributed on an \"AS IS\" BASIS,\n  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n  See the License for the specific language governing permissions and\n  limitations under the License.\n\n*/\n\npragma solidity ^0.5.5;\n\n\nlibrary LibBytes {\n\n    using LibBytes for bytes;\n\n    /// @dev Gets the memory address for a byte array.\n    /// @param input Byte array to lookup.\n    /// @return memoryAddress Memory address of byte array. This\n    ///         points to the header of the byte array which contains\n    ///         the length.\n    function rawAddress(bytes memory input)\n        internal\n        pure\n        returns (uint256 memoryAddress)\n    {\n        assembly {\n            memoryAddress := input\n        }\n        return memoryAddress;\n    }\n    \n    /// @dev Gets the memory address for the contents of a byte array.\n    /// @param input Byte array to lookup.\n    /// @return memoryAddress Memory address of the contents of the byte array.\n    function contentAddress(bytes memory input)\n        internal\n        pure\n        returns (uint256 memoryAddress)\n    {\n        assembly {\n            memoryAddress := add(input, 32)\n        }\n        return memoryAddress;\n    }\n\n    /// @dev Copies `length` bytes from memory location `source` to `dest`.\n    /// @param dest memory address to copy bytes to.\n    /// @param source memory address to copy bytes from.\n    /// @param length number of bytes to copy.\n    function memCopy(\n        uint256 dest,\n        uint256 source,\n        uint256 length\n    )\n        internal\n        pure\n    {\n        if (length < 32) {\n            // Handle a partial word by reading destination and masking\n            // off the bits we are interested in.\n            // This correctly handles overlap, zero lengths and source == dest\n            assembly {\n                let mask := sub(exp(256, sub(32, length)), 1)\n                let s := and(mload(source), not(mask))\n                let d := and(mload(dest), mask)\n                mstore(dest, or(s, d))\n            }\n        } else {\n            // Skip the O(length) loop when source == dest.\n            if (source == dest) {\n                return;\n            }\n\n            // For large copies we copy whole words at a time. The final\n            // word is aligned to the end of the range (instead of after the\n            // previous) to handle partial words. So a copy will look like this:\n            //\n            //  ####\n            //      ####\n            //          ####\n            //            ####\n            //\n            // We handle overlap in the source and destination range by\n            // changing the copying direction. This prevents us from\n            // overwriting parts of source that we still need to copy.\n            //\n            // This correctly handles source == dest\n            //\n            if (source > dest) {\n                assembly {\n                    // We subtract 32 from `sEnd` and `dEnd` because it\n                    // is easier to compare with in the loop, and these\n                    // are also the addresses we need for copying the\n                    // last bytes.\n                    length := sub(length, 32)\n                    let sEnd := add(source, length)\n                    let dEnd := add(dest, length)\n\n                    // Remember the last 32 bytes of source\n                    // This needs to be done here and not after the loop\n                    // because we may have overwritten the last bytes in\n                    // source already due to overlap.\n                    let last := mload(sEnd)\n\n                    // Copy whole words front to back\n                    // Note: the first check is always true,\n                    // this could have been a do-while loop.\n                    // solhint-disable-next-line no-empty-blocks\n                    for {} lt(source, sEnd) {} {\n                        mstore(dest, mload(source))\n                        source := add(source, 32)\n                        dest := add(dest, 32)\n                    }\n                    \n                    // Write the last 32 bytes\n                    mstore(dEnd, last)\n                }\n            } else {\n                assembly {\n                    // We subtract 32 from `sEnd` and `dEnd` because those\n                    // are the starting points when copying a word at the end.\n                    length := sub(length, 32)\n                    let sEnd := add(source, length)\n                    let dEnd := add(dest, length)\n\n                    // Remember the first 32 bytes of source\n                    // This needs to be done here and not after the loop\n                    // because we may have overwritten the first bytes in\n                    // source already due to overlap.\n                    let first := mload(source)\n\n                    // Copy whole words back to front\n                    // We use a signed comparisson here to allow dEnd to become\n                    // negative (happens when source and dest < 32). Valid\n                    // addresses in local memory will never be larger than\n                    // 2**255, so they can be safely re-interpreted as signed.\n                    // Note: the first check is always true,\n                    // this could have been a do-while loop.\n                    // solhint-disable-next-line no-empty-blocks\n                    for {} slt(dest, dEnd) {} {\n                        mstore(dEnd, mload(sEnd))\n                        sEnd := sub(sEnd, 32)\n                        dEnd := sub(dEnd, 32)\n                    }\n                    \n                    // Write the first 32 bytes\n                    mstore(dest, first)\n                }\n            }\n        }\n    }\n\n    /// @dev Returns a slices from a byte array.\n    /// @param b The byte array to take a slice from.\n    /// @param from The starting index for the slice (inclusive).\n    /// @param to The final index for the slice (exclusive).\n    /// @return result The slice containing bytes at indices [from, to)\n    function slice(\n        bytes memory b,\n        uint256 from,\n        uint256 to\n    )\n        internal\n        pure\n        returns (bytes memory result)\n    {\n        require(\n            from <= to,\n            \"FROM_LESS_THAN_TO_REQUIRED\"\n        );\n        require(\n            to <= b.length,\n            \"TO_LESS_THAN_LENGTH_REQUIRED\"\n        );\n        \n        // Create a new bytes structure and copy contents\n        result = new bytes(to - from);\n        memCopy(\n            result.contentAddress(),\n            b.contentAddress() + from,\n            result.length\n        );\n        return result;\n    }\n    \n    /// @dev Returns a slice from a byte array without preserving the input.\n    /// @param b The byte array to take a slice from. Will be destroyed in the process.\n    /// @param from The starting index for the slice (inclusive).\n    /// @param to The final index for the slice (exclusive).\n    /// @return result The slice containing bytes at indices [from, to)\n    /// @dev When `from == 0`, the original array will match the slice. In other cases its state will be corrupted.\n    function sliceDestructive(\n        bytes memory b,\n        uint256 from,\n        uint256 to\n    )\n        internal\n        pure\n        returns (bytes memory result)\n    {\n        require(\n            from <= to,\n            \"FROM_LESS_THAN_TO_REQUIRED\"\n        );\n        require(\n            to <= b.length,\n            \"TO_LESS_THAN_LENGTH_REQUIRED\"\n        );\n        \n        // Create a new bytes structure around [from, to) in-place.\n        assembly {\n            result := add(b, from)\n            mstore(result, sub(to, from))\n        }\n        return result;\n    }\n\n    /// @dev Pops the last byte off of a byte array by modifying its length.\n    /// @param b Byte array that will be modified.\n    /// @return The byte that was popped off.\n    function popLastByte(bytes memory b)\n        internal\n        pure\n        returns (bytes1 result)\n    {\n        require(\n            b.length > 0,\n            \"GREATER_THAN_ZERO_LENGTH_REQUIRED\"\n        );\n\n        // Store last byte.\n        result = b[b.length - 1];\n\n        assembly {\n            // Decrement length of byte array.\n            let newLen := sub(mload(b), 1)\n            mstore(b, newLen)\n        }\n        return result;\n    }\n\n    /// @dev Pops the last 20 bytes off of a byte array by modifying its length.\n    /// @param b Byte array that will be modified.\n    /// @return The 20 byte address that was popped off.\n    function popLast20Bytes(bytes memory b)\n        internal\n        pure\n        returns (address result)\n    {\n        require(\n            b.length >= 20,\n            \"GREATER_OR_EQUAL_TO_20_LENGTH_REQUIRED\"\n        );\n\n        // Store last 20 bytes.\n        result = readAddress(b, b.length - 20);\n\n        assembly {\n            // Subtract 20 from byte array length.\n            let newLen := sub(mload(b), 20)\n            mstore(b, newLen)\n        }\n        return result;\n    }\n\n    /// @dev Tests equality of two byte arrays.\n    /// @param lhs First byte array to compare.\n    /// @param rhs Second byte array to compare.\n    /// @return True if arrays are the same. False otherwise.\n    function equals(\n        bytes memory lhs,\n        bytes memory rhs\n    )\n        internal\n        pure\n        returns (bool equal)\n    {\n        // Keccak gas cost is 30 + numWords * 6. This is a cheap way to compare.\n        // We early exit on unequal lengths, but keccak would also correctly\n        // handle this.\n        return lhs.length == rhs.length && keccak256(lhs) == keccak256(rhs);\n    }\n\n    /// @dev Reads an address from a position in a byte array.\n    /// @param b Byte array containing an address.\n    /// @param index Index in byte array of address.\n    /// @return address from byte array.\n    function readAddress(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (address result)\n    {\n        require(\n            b.length >= index + 20,  // 20 is length of address\n            \"GREATER_OR_EQUAL_TO_20_LENGTH_REQUIRED\"\n        );\n\n        // Add offset to index:\n        // 1. Arrays are prefixed by 32-byte length parameter (add 32 to index)\n        // 2. Account for size difference between address length and 32-byte storage word (subtract 12 from index)\n        index += 20;\n\n        // Read address from array memory\n        assembly {\n            // 1. Add index to address of bytes array\n            // 2. Load 32-byte word from memory\n            // 3. Apply 20-byte mask to obtain address\n            result := and(mload(add(b, index)), 0xffffffffffffffffffffffffffffffffffffffff)\n        }\n        return result;\n    }\n\n    /// @dev Writes an address into a specific position in a byte array.\n    /// @param b Byte array to insert address into.\n    /// @param index Index in byte array of address.\n    /// @param input Address to put into byte array.\n    function writeAddress(\n        bytes memory b,\n        uint256 index,\n        address input\n    )\n        internal\n        pure\n    {\n        require(\n            b.length >= index + 20,  // 20 is length of address\n            \"GREATER_OR_EQUAL_TO_20_LENGTH_REQUIRED\"\n        );\n\n        // Add offset to index:\n        // 1. Arrays are prefixed by 32-byte length parameter (add 32 to index)\n        // 2. Account for size difference between address length and 32-byte storage word (subtract 12 from index)\n        index += 20;\n\n        // Store address into array memory\n        assembly {\n            // The address occupies 20 bytes and mstore stores 32 bytes.\n            // First fetch the 32-byte word where we'll be storing the address, then\n            // apply a mask so we have only the bytes in the word that the address will not occupy.\n            // Then combine these bytes with the address and store the 32 bytes back to memory with mstore.\n\n            // 1. Add index to address of bytes array\n            // 2. Load 32-byte word from memory\n            // 3. Apply 12-byte mask to obtain extra bytes occupying word of memory where we'll store the address\n            let neighbors := and(\n                mload(add(b, index)),\n                0xffffffffffffffffffffffff0000000000000000000000000000000000000000\n            )\n            \n            // Make sure input address is clean.\n            // (Solidity does not guarantee this)\n            input := and(input, 0xffffffffffffffffffffffffffffffffffffffff)\n\n            // Store the neighbors and address into memory\n            mstore(add(b, index), xor(input, neighbors))\n        }\n    }\n\n    /// @dev Reads a bytes32 value from a position in a byte array.\n    /// @param b Byte array containing a bytes32 value.\n    /// @param index Index in byte array of bytes32 value.\n    /// @return bytes32 value from byte array.\n    function readBytes32(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (bytes32 result)\n    {\n        require(\n            b.length >= index + 32,\n            \"GREATER_OR_EQUAL_TO_32_LENGTH_REQUIRED\"\n        );\n\n        // Arrays are prefixed by a 256 bit length parameter\n        index += 32;\n\n        // Read the bytes32 from array memory\n        assembly {\n            result := mload(add(b, index))\n        }\n        return result;\n    }\n\n    /// @dev Writes a bytes32 into a specific position in a byte array.\n    /// @param b Byte array to insert <input> into.\n    /// @param index Index in byte array of <input>.\n    /// @param input bytes32 to put into byte array.\n    function writeBytes32(\n        bytes memory b,\n        uint256 index,\n        bytes32 input\n    )\n        internal\n        pure\n    {\n        require(\n            b.length >= index + 32,\n            \"GREATER_OR_EQUAL_TO_32_LENGTH_REQUIRED\"\n        );\n\n        // Arrays are prefixed by a 256 bit length parameter\n        index += 32;\n\n        // Read the bytes32 from array memory\n        assembly {\n            mstore(add(b, index), input)\n        }\n    }\n\n    /// @dev Reads a uint256 value from a position in a byte array.\n    /// @param b Byte array containing a uint256 value.\n    /// @param index Index in byte array of uint256 value.\n    /// @return uint256 value from byte array.\n    function readUint256(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (uint256 result)\n    {\n        result = uint256(readBytes32(b, index));\n        return result;\n    }\n\n    /// @dev Writes a uint256 into a specific position in a byte array.\n    /// @param b Byte array to insert <input> into.\n    /// @param index Index in byte array of <input>.\n    /// @param input uint256 to put into byte array.\n    function writeUint256(\n        bytes memory b,\n        uint256 index,\n        uint256 input\n    )\n        internal\n        pure\n    {\n        writeBytes32(b, index, bytes32(input));\n    }\n\n    /// @dev Reads an unpadded bytes4 value from a position in a byte array.\n    /// @param b Byte array containing a bytes4 value.\n    /// @param index Index in byte array of bytes4 value.\n    /// @return bytes4 value from byte array.\n    function readBytes4(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (bytes4 result)\n    {\n        require(\n            b.length >= index + 4,\n            \"GREATER_OR_EQUAL_TO_4_LENGTH_REQUIRED\"\n        );\n\n        // Arrays are prefixed by a 32 byte length field\n        index += 32;\n\n        // Read the bytes4 from array memory\n        assembly {\n            result := mload(add(b, index))\n            // Solidity does not require us to clean the trailing bytes.\n            // We do it anyway\n            result := and(result, 0xFFFFFFFF00000000000000000000000000000000000000000000000000000000)\n        }\n        return result;\n    }\n\n    /// @dev Reads nested bytes from a specific position.\n    /// @dev NOTE: the returned value overlaps with the input value.\n    ///            Both should be treated as immutable.\n    /// @param b Byte array containing nested bytes.\n    /// @param index Index of nested bytes.\n    /// @return result Nested bytes.\n    function readBytesWithLength(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (bytes memory result)\n    {\n        // Read length of nested bytes\n        uint256 nestedBytesLength = readUint256(b, index);\n        index += 32;\n\n        // Assert length of <b> is valid, given\n        // length of nested bytes\n        require(\n            b.length >= index + nestedBytesLength,\n            \"GREATER_OR_EQUAL_TO_NESTED_BYTES_LENGTH_REQUIRED\"\n        );\n        \n        // Return a pointer to the byte array as it exists inside `b`\n        assembly {\n            result := add(b, index)\n        }\n        return result;\n    }\n\n    /// @dev Inserts bytes at a specific position in a byte array.\n    /// @param b Byte array to insert <input> into.\n    /// @param index Index in byte array of <input>.\n    /// @param input bytes to insert.\n    function writeBytesWithLength(\n        bytes memory b,\n        uint256 index,\n        bytes memory input\n    )\n        internal\n        pure\n    {\n        // Assert length of <b> is valid, given\n        // length of input\n        require(\n            b.length >= index + 32 + input.length,  // 32 bytes to store length\n            \"GREATER_OR_EQUAL_TO_NESTED_BYTES_LENGTH_REQUIRED\"\n        );\n\n        // Copy <input> into <b>\n        memCopy(\n            b.contentAddress() + index,\n            input.rawAddress(), // includes length of <input>\n            input.length + 32   // +32 bytes to store <input> length\n        );\n    }\n\n    /// @dev Performs a deep copy of a byte array onto another byte array of greater than or equal length.\n    /// @param dest Byte array that will be overwritten with source bytes.\n    /// @param source Byte array to copy onto dest bytes.\n    function deepCopyBytes(\n        bytes memory dest,\n        bytes memory source\n    )\n        internal\n        pure\n    {\n        uint256 sourceLen = source.length;\n        // Dest length must be >= source length, or some bytes would not be copied.\n        require(\n            dest.length >= sourceLen,\n            \"GREATER_OR_EQUAL_TO_SOURCE_BYTES_LENGTH_REQUIRED\"\n        );\n        memCopy(\n            dest.contentAddress(),\n            source.contentAddress(),\n            sourceLen\n        );\n    }\n}\n\n// File: contracts/GsnUtils.sol\n\npragma solidity ^0.5.5;\n\n\nlibrary GsnUtils {\n\n    /**\n     * extract method sig from encoded function call\n     */\n    function getMethodSig(bytes memory msgData) internal pure returns (bytes4) {\n        return bytes4(bytes32(LibBytes.readUint256(msgData, 0)));\n    }\n\n    /**\n     * extract parameter from encoded-function block.\n     * see: https://solidity.readthedocs.io/en/develop/abi-spec.html#formal-specification-of-the-encoding\n     * note that the type of the parameter must be static.\n     * the return value should be casted to the right type.\n     */\n    function getParam(bytes memory msgData, uint index) internal pure returns (uint) {\n        return LibBytes.readUint256(msgData, 4 + index * 32);\n    }\n\n    /**\n     * extract dynamic-sized (string/bytes) parameter.\n     * we assume that there ARE dynamic parameters, hence getParam(0) is the offset to the first\n     * dynamic param\n     * https://solidity.readthedocs.io/en/develop/abi-spec.html#use-of-dynamic-types\n     */\n    function getBytesParam(bytes memory msgData, uint index) internal pure returns (bytes memory ret)  {\n        uint ofs = getParam(msgData,index)+4;\n        uint len = LibBytes.readUint256(msgData, ofs);\n        ret = LibBytes.slice(msgData, ofs+32, ofs+32+len);\n    }\n\n    function getStringParam(bytes memory msgData, uint index) internal pure returns (string memory) {\n        return string(getBytesParam(msgData,index));\n    }\n\n    function checkSig(address signer, bytes32 hash, bytes memory sig) pure internal returns (bool) {\n        // Check if @v,@r,@s are a valid signature of @signer for @hash\n        uint8 v = uint8(sig[0]);\n        bytes32 r = LibBytes.readBytes32(sig,1);\n        bytes32 s = LibBytes.readBytes32(sig,33);\n        return signer == ecrecover(hash, v, r, s);\n    }\n}\n\n// File: contracts/RLPReader.sol\n\n/*\n* Taken from https://github.com/hamdiallam/Solidity-RLP\n*/\n\npragma solidity ^0.5.5;\n\nlibrary RLPReader {\n\n    uint8 constant STRING_SHORT_START = 0x80;\n    uint8 constant STRING_LONG_START = 0xb8;\n    uint8 constant LIST_SHORT_START = 0xc0;\n    uint8 constant LIST_LONG_START = 0xf8;\n    uint8 constant WORD_SIZE = 32;\n\n    struct RLPItem {\n        uint len;\n        uint memPtr;\n    }\n\n    using RLPReader for bytes;\n    using RLPReader for uint;\n    using RLPReader for RLPReader.RLPItem;\n\n    // helper function to decode rlp encoded  ethereum transaction\n    /*\n    * @param rawTransaction RLP encoded ethereum transaction\n    * @return tuple (nonce,gasPrice,gasLimit,to,value,data)\n    */\n\n    function decodeTransaction(bytes memory rawTransaction) internal pure returns (uint, uint, uint, address, uint, bytes memory){\n        RLPReader.RLPItem[] memory values = rawTransaction.toRlpItem().toList(); // must convert to an rlpItem first!\n        return (values[0].toUint(), values[1].toUint(), values[2].toUint(), values[3].toAddress(), values[4].toUint(), values[5].toBytes());\n    }\n\n    /*\n    * @param item RLP encoded bytes\n    */\n    function toRlpItem(bytes memory item) internal pure returns (RLPItem memory) {\n        if (item.length == 0)\n            return RLPItem(0, 0);\n        uint memPtr;\n        assembly {\n            memPtr := add(item, 0x20)\n        }\n        return RLPItem(item.length, memPtr);\n    }\n    /*\n    * @param item RLP encoded list in bytes\n    */\n    function toList(RLPItem memory item) internal pure returns (RLPItem[] memory result) {\n        require(isList(item), \"isList failed\");\n        uint items = numItems(item);\n        result = new RLPItem[](items);\n        uint memPtr = item.memPtr + _payloadOffset(item.memPtr);\n        uint dataLen;\n        for (uint i = 0; i < items; i++) {\n            dataLen = _itemLength(memPtr);\n            result[i] = RLPItem(dataLen, memPtr);\n            memPtr = memPtr + dataLen;\n        }\n    }\n    /*\n    * Helpers\n    */\n    // @return indicator whether encoded payload is a list. negate this function call for isData.\n    function isList(RLPItem memory item) internal pure returns (bool) {\n        uint8 byte0;\n        uint memPtr = item.memPtr;\n        assembly {\n            byte0 := byte(0, mload(memPtr))\n        }\n        if (byte0 < LIST_SHORT_START)\n            return false;\n        return true;\n    }\n    // @return number of payload items inside an encoded list.\n    function numItems(RLPItem memory item) internal pure returns (uint) {\n        uint count = 0;\n        uint currPtr = item.memPtr + _payloadOffset(item.memPtr);\n        uint endPtr = item.memPtr + item.len;\n        while (currPtr < endPtr) {\n            currPtr = currPtr + _itemLength(currPtr);\n            // skip over an item\n            count++;\n        }\n        return count;\n    }\n    // @return entire rlp item byte length\n    function _itemLength(uint memPtr) internal pure returns (uint len) {\n        uint byte0;\n        assembly {\n            byte0 := byte(0, mload(memPtr))\n        }\n        if (byte0 < STRING_SHORT_START)\n            return 1;\n        else if (byte0 < STRING_LONG_START)\n            return byte0 - STRING_SHORT_START + 1;\n        else if (byte0 < LIST_SHORT_START) {\n            assembly {\n                let byteLen := sub(byte0, 0xb7) // # of bytes the actual length is\n                memPtr := add(memPtr, 1) // skip over the first byte\n            /* 32 byte word size */\n                let dataLen := div(mload(memPtr), exp(256, sub(32, byteLen))) // right shifting to get the len\n                len := add(dataLen, add(byteLen, 1))\n            }\n        }\n        else if (byte0 < LIST_LONG_START) {\n            return byte0 - LIST_SHORT_START + 1;\n        }\n        else {\n            assembly {\n                let byteLen := sub(byte0, 0xf7)\n                memPtr := add(memPtr, 1)\n                let dataLen := div(mload(memPtr), exp(256, sub(32, byteLen))) // right shifting to the correct length\n                len := add(dataLen, add(byteLen, 1))\n            }\n        }\n    }\n    // @return number of bytes until the data\n    function _payloadOffset(uint memPtr) internal pure returns (uint) {\n        uint byte0;\n        assembly {\n            byte0 := byte(0, mload(memPtr))\n        }\n        if (byte0 < STRING_SHORT_START)\n            return 0;\n        else if (byte0 < STRING_LONG_START || (byte0 >= LIST_SHORT_START && byte0 < LIST_LONG_START))\n            return 1;\n        else if (byte0 < LIST_SHORT_START)  // being explicit\n            return byte0 - (STRING_LONG_START - 1) + 1;\n        else\n            return byte0 - (LIST_LONG_START - 1) + 1;\n    }\n    /** RLPItem conversions into data types **/\n    // @returns raw rlp encoding in bytes\n    function toRlpBytes(RLPItem memory item) internal pure returns (bytes memory) {\n        bytes memory result = new bytes(item.len);\n        uint ptr;\n        assembly {\n            ptr := add(0x20, result)\n        }\n        copy(item.memPtr, ptr, item.len);\n        return result;\n    }\n\n    function toBoolean(RLPItem memory item) internal pure returns (bool) {\n        require(item.len == 1, \"Invalid RLPItem. Booleans are encoded in 1 byte\");\n        uint result;\n        uint memPtr = item.memPtr;\n        assembly {\n            result := byte(0, mload(memPtr))\n        }\n        return result == 0 ? false : true;\n    }\n\n    function toAddress(RLPItem memory item) internal pure returns (address) {\n        // 1 byte for the length prefix according to RLP spec\n        require(item.len <= 21, \"Invalid RLPItem. Addresses are encoded in 20 bytes or less\");\n        return address(toUint(item));\n    }\n\n    function toUint(RLPItem memory item) internal pure returns (uint) {\n        uint offset = _payloadOffset(item.memPtr);\n        uint len = item.len - offset;\n        uint memPtr = item.memPtr + offset;\n        uint result;\n        assembly {\n            result := div(mload(memPtr), exp(256, sub(32, len))) // shift to the correct location\n        }\n        return result;\n    }\n\n    function toBytes(RLPItem memory item) internal pure returns (bytes memory) {\n        uint offset = _payloadOffset(item.memPtr);\n        uint len = item.len - offset;\n        // data length\n        bytes memory result = new bytes(len);\n        uint destPtr;\n        assembly {\n            destPtr := add(0x20, result)\n        }\n        copy(item.memPtr + offset, destPtr, len);\n        return result;\n    }\n    /*\n    * @param src Pointer to source\n    * @param dest Pointer to destination\n    * @param len Amount of memory to copy from the source\n    */\n    function copy(uint src, uint dest, uint len) internal pure {\n        // copy as many word sizes as possible\n        for (; len >= WORD_SIZE; len -= WORD_SIZE) {\n            assembly {\n                mstore(dest, mload(src))\n            }\n            src += WORD_SIZE;\n            dest += WORD_SIZE;\n        }\n        // left over bytes. Mask is used to remove unwanted bytes from the word\n        uint mask = 256 ** (WORD_SIZE - len) - 1;\n        assembly {\n            let srcpart := and(mload(src), not(mask)) // zero out src\n            let destpart := and(mload(dest), mask) // retrieve the bytes\n            mstore(dest, or(destpart, srcpart))\n        }\n    }\n}\n\n// File: openzeppelin-solidity/contracts/math/SafeMath.sol\n\npragma solidity ^0.5.0;\n\n/**\n * @dev Wrappers over Solidity's arithmetic operations with added overflow\n * checks.\n *\n * Arithmetic operations in Solidity wrap on overflow. This can easily result\n * in bugs, because programmers usually assume that an overflow raises an\n * error, which is the standard behavior in high level programming languages.\n * `SafeMath` restores this intuition by reverting the transaction when an\n * operation overflows.\n *\n * Using this library instead of the unchecked operations eliminates an entire\n * class of bugs, so it's recommended to use it always.\n */\nlibrary SafeMath {\n    /**\n     * @dev Returns the addition of two unsigned integers, reverting on\n     * overflow.\n     *\n     * Counterpart to Solidity's `+` operator.\n     *\n     * Requirements:\n     * - Addition cannot overflow.\n     */\n    function add(uint256 a, uint256 b) internal pure returns (uint256) {\n        uint256 c = a + b;\n        require(c >= a, \"SafeMath: addition overflow\");\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the subtraction of two unsigned integers, reverting on\n     * overflow (when the result is negative).\n     *\n     * Counterpart to Solidity's `-` operator.\n     *\n     * Requirements:\n     * - Subtraction cannot overflow.\n     */\n    function sub(uint256 a, uint256 b) internal pure returns (uint256) {\n        require(b <= a, \"SafeMath: subtraction overflow\");\n        uint256 c = a - b;\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the multiplication of two unsigned integers, reverting on\n     * overflow.\n     *\n     * Counterpart to Solidity's `*` operator.\n     *\n     * Requirements:\n     * - Multiplication cannot overflow.\n     */\n    function mul(uint256 a, uint256 b) internal pure returns (uint256) {\n        // Gas optimization: this is cheaper than requiring 'a' not being zero, but the\n        // benefit is lost if 'b' is also tested.\n        // See: https://github.com/OpenZeppelin/openzeppelin-solidity/pull/522\n        if (a == 0) {\n            return 0;\n        }\n\n        uint256 c = a * b;\n        require(c / a == b, \"SafeMath: multiplication overflow\");\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the integer division of two unsigned integers. Reverts on\n     * division by zero. The result is rounded towards zero.\n     *\n     * Counterpart to Solidity's `/` operator. Note: this function uses a\n     * `revert` opcode (which leaves remaining gas untouched) while Solidity\n     * uses an invalid opcode to revert (consuming all remaining gas).\n     *\n     * Requirements:\n     * - The divisor cannot be zero.\n     */\n    function div(uint256 a, uint256 b) internal pure returns (uint256) {\n        // Solidity only automatically asserts when dividing by 0\n        require(b > 0, \"SafeMath: division by zero\");\n        uint256 c = a / b;\n        // assert(a == b * c + a % b); // There is no case in which this doesn't hold\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the remainder of dividing two unsigned integers. (unsigned integer modulo),\n     * Reverts when dividing by zero.\n     *\n     * Counterpart to Solidity's `%` operator. This function uses a `revert`\n     * opcode (which leaves remaining gas untouched) while Solidity uses an\n     * invalid opcode to revert (consuming all remaining gas).\n     *\n     * Requirements:\n     * - The divisor cannot be zero.\n     */\n    function mod(uint256 a, uint256 b) internal pure returns (uint256) {\n        require(b != 0, \"SafeMath: modulo by zero\");\n        return a % b;\n    }\n}\n\n// File: openzeppelin-solidity/contracts/cryptography/ECDSA.sol\n\npragma solidity ^0.5.0;\n\n/**\n * @dev Elliptic Curve Digital Signature Algorithm (ECDSA) operations.\n *\n * These functions can be used to verify that a message was signed by the holder\n * of the private keys of a given address.\n */\nlibrary ECDSA {\n    /**\n     * @dev Returns the address that signed a hashed message (`hash`) with\n     * `signature`. This address can then be used for verification purposes.\n     *\n     * The `ecrecover` EVM opcode allows for malleable (non-unique) signatures:\n     * this function rejects them by requiring the `s` value to be in the lower\n     * half order, and the `v` value to be either 27 or 28.\n     *\n     * (.note) This call _does not revert_ if the signature is invalid, or\n     * if the signer is otherwise unable to be retrieved. In those scenarios,\n     * the zero address is returned.\n     *\n     * (.warning) `hash` _must_ be the result of a hash operation for the\n     * verification to be secure: it is possible to craft signatures that\n     * recover to arbitrary addresses for non-hashed data. A safe way to ensure\n     * this is by receiving a hash of the original message (which may otherwise)\n     * be too long), and then calling `toEthSignedMessageHash` on it.\n     */\n    function recover(bytes32 hash, bytes memory signature) internal pure returns (address) {\n        // Check the signature length\n        if (signature.length != 65) {\n            return (address(0));\n        }\n\n        // Divide the signature in r, s and v variables\n        bytes32 r;\n        bytes32 s;\n        uint8 v;\n\n        // ecrecover takes the signature parameters, and the only way to get them\n        // currently is to use assembly.\n        // solhint-disable-next-line no-inline-assembly\n        assembly {\n            r := mload(add(signature, 0x20))\n            s := mload(add(signature, 0x40))\n            v := byte(0, mload(add(signature, 0x60)))\n        }\n\n        // EIP-2 still allows signature malleability for ecrecover(). Remove this possibility and make the signature\n        // unique. Appendix F in the Ethereum Yellow paper (https://ethereum.github.io/yellowpaper/paper.pdf), defines\n        // the valid range for s in (281): 0 < s < secp256k1n  2 + 1, and for v in (282): v  {27, 28}. Most\n        // signatures from current libraries generate a unique signature with an s-value in the lower half order.\n        //\n        // If your library generates malleable signatures, such as s-values in the upper range, calculate a new s-value\n        // with 0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEBAAEDCE6AF48A03BBFD25E8CD0364141 - s1 and flip v from 27 to 28 or\n        // vice versa. If your library also generates signatures with 0/1 for v instead 27/28, add 27 to v to accept\n        // these malleable signatures as well.\n        if (uint256(s) > 0x7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF5D576E7357A4501DDFE92F46681B20A0) {\n            return address(0);\n        }\n\n        if (v != 27 && v != 28) {\n            return address(0);\n        }\n\n        // If the signature is valid (and not malleable), return the signer address\n        return ecrecover(hash, v, r, s);\n    }\n\n    /**\n     * @dev Returns an Ethereum Signed Message, created from a `hash`. This\n     * replicates the behavior of the\n     * [`eth_sign`](https://github.com/ethereum/wiki/wiki/JSON-RPC#eth_sign)\n     * JSON-RPC method.\n     *\n     * See `recover`.\n     */\n    function toEthSignedMessageHash(bytes32 hash) internal pure returns (bytes32) {\n        // 32 is the length in bytes of hash,\n        // enforced by the type signature above\n        return keccak256(abi.encodePacked(\"\\x19Ethereum Signed Message:\\n32\", hash));\n    }\n}\n\n// File: contracts/RelayHub.sol\n\npragma solidity ^0.5.5;\n\n\n\n\n\n\n\n\ncontract RelayHub is IRelayHub {\n    using ECDSA for bytes32;\n\n    // IMPORTANT: RSK-related adjustments\n    // The original minimumStake, minimumRelayBalance and maximumRecipientDeposit\n    // were adjusted to reflect an estimated equivalence of 1 Ether = 0.02 RBTC\n    // This is so that running a relayer is not significatively more expensive\n    // on RSK given the value of a Bitcoin is *higher* than that of an Ether.\n\n    // Minimum stake a relay can have. An attack to the network will never cost less than half this value.\n    uint256 constant private minimumStake = 0.02 ether;\n\n    // Minimum unstake delay. A relay needs to wait for this time to elapse after deregistering to retrieve its stake.\n    uint256 constant private minimumUnstakeDelay = 1 weeks;\n    // Maximum unstake delay. Prevents relays from locking their funds into the RelayHub for too long.\n    uint256 constant private maximumUnstakeDelay = 12 weeks;\n\n    // Minimum balance required for a relay to register or re-register. Prevents user error in registering a relay that\n    // will not be able to immediatly start serving requests.\n    uint256 constant private minimumRelayBalance = 0.002 ether;\n\n    // Maximum funds that can be deposited at once. Prevents user error by disallowing large deposits.\n    uint256 constant private maximumRecipientDeposit = 0.04 ether;\n\n    /**\n    * the total gas overhead of relayCall(), before the first gasleft() and after the last gasleft().\n    * Assume that relay has non-zero balance (costs 15'000 more otherwise).\n    */\n\n    // Gas cost of all relayCall() instructions before first gasleft() and after last gasleft()\n    uint256 constant private gasOverhead = 48204;\n\n    // Gas cost of all relayCall() instructions after first gasleft() and before last gasleft()\n    uint256 constant private gasReserve = 100000;\n\n    // Approximation of how much calling recipientCallsAtomic costs\n    uint256 constant private recipientCallsAtomicOverhead = 5000;\n\n    // Gas stipends for acceptRelayedCall, preRelayedCall and postRelayedCall\n    uint256 constant private acceptRelayedCallMaxGas = 50000;\n    uint256 constant private preRelayedCallMaxGas = 100000;\n    uint256 constant private postRelayedCallMaxGas = 100000;\n\n    // Nonces of senders, used to prevent replay attacks\n    mapping(address => uint256) private nonces;\n\n    enum AtomicRecipientCallsStatus {OK, CanRelayFailed, RelayedCallFailed, PreRelayedFailed, PostRelayedFailed}\n\n    struct Relay {\n        uint256 stake;          // Ether staked for this relay\n        uint256 unstakeDelay;   // Time that must elapse before the owner can retrieve the stake after calling remove\n        uint256 unstakeTime;    // Time when unstake will be callable. A value of zero indicates the relay has not been removed.\n        address payable owner;  // Relay's owner, will receive revenue and manage it (call stake, remove and unstake).\n        RelayState state;\n    }\n\n    mapping(address => Relay) private relays;\n    mapping(address => uint256) private balances;\n\n    string public version = \"1.0.0\";\n\n    function stake(address relay, uint256 unstakeDelay) external payable {\n        if (relays[relay].state == RelayState.Unknown) {\n            require(msg.sender != relay, \"relay cannot stake for itself\");\n            relays[relay].owner = msg.sender;\n            relays[relay].state = RelayState.Staked;\n\n        } else if ((relays[relay].state == RelayState.Staked) || (relays[relay].state == RelayState.Registered)) {\n            require(relays[relay].owner == msg.sender, \"not owner\");\n\n        } else {\n            revert('wrong state for stake');\n        }\n\n        // Increase the stake\n\n        uint256 addedStake = msg.value;\n        relays[relay].stake += addedStake;\n\n        // The added stake may be e.g. zero when only the unstake delay is being updated\n        require(relays[relay].stake >= minimumStake, \"stake lower than minimum\");\n\n        // Increase the unstake delay\n\n        require(unstakeDelay >= minimumUnstakeDelay, \"delay lower than minimum\");\n        require(unstakeDelay <= maximumUnstakeDelay, \"delay higher than maximum\");\n\n        require(unstakeDelay >= relays[relay].unstakeDelay, \"unstakeDelay cannot be decreased\");\n        relays[relay].unstakeDelay = unstakeDelay;\n\n        emit Staked(relay, relays[relay].stake, relays[relay].unstakeDelay);\n    }\n\n    function registerRelay(uint256 transactionFee, string memory url) public {\n        address relay = msg.sender;\n\n        require(relay == tx.origin, \"Contracts cannot register as relays\");\n        require(relays[relay].state == RelayState.Staked || relays[relay].state == RelayState.Registered, \"wrong state for stake\");\n        require(relay.balance >= minimumRelayBalance, \"balance lower than minimum\");\n\n        if (relays[relay].state != RelayState.Registered) {\n            relays[relay].state = RelayState.Registered;\n        }\n\n        emit RelayAdded(relay, relays[relay].owner, transactionFee, relays[relay].stake, relays[relay].unstakeDelay, url);\n    }\n\n    function removeRelayByOwner(address relay) public {\n        require(relays[relay].owner == msg.sender, \"not owner\");\n        require((relays[relay].state == RelayState.Staked) || (relays[relay].state == RelayState.Registered), \"already removed\");\n\n        // Start the unstake counter\n        relays[relay].unstakeTime = relays[relay].unstakeDelay + now;\n        relays[relay].state = RelayState.Removed;\n\n        emit RelayRemoved(relay, relays[relay].unstakeTime);\n    }\n\n    function unstake(address relay) public {\n        require(canUnstake(relay), \"canUnstake failed\");\n        require(relays[relay].owner == msg.sender, \"not owner\");\n\n        address payable owner = msg.sender;\n        uint256 amount = relays[relay].stake;\n\n        delete relays[relay];\n\n        owner.transfer(amount);\n        emit Unstaked(relay, amount);\n    }\n\n    function getRelay(address relay) external view returns (uint256 totalStake, uint256 unstakeDelay, uint256 unstakeTime, address payable owner, RelayState state) {\n        totalStake = relays[relay].stake;\n        unstakeDelay = relays[relay].unstakeDelay;\n        unstakeTime = relays[relay].unstakeTime;\n        owner = relays[relay].owner;\n        state = relays[relay].state;\n    }\n\n    /**\n     * deposit ether for a contract.\n     * This ether will be used to repay relay calls into this contract.\n     * Contract owner should monitor the balance of his contract, and make sure\n     * to deposit more, otherwise the contract won't be able to receive relayed calls.\n     * Unused deposited can be withdrawn with `withdraw()`\n     */\n    function depositFor(address target) public payable {\n        uint256 amount = msg.value;\n        require(amount <= maximumRecipientDeposit, \"deposit too big\");\n\n        balances[target] = SafeMath.add(balances[target], amount);\n\n        emit Deposited(target, msg.sender, amount);\n    }\n\n    //check the deposit balance of a contract.\n    function balanceOf(address target) external view returns (uint256) {\n        return balances[target];\n    }\n\n    /**\n     * withdraw funds.\n     * caller is either a relay owner, withdrawing collected transaction fees.\n     * or a IRelayRecipient contract, withdrawing its deposit.\n     * note that while everyone can `depositFor()` a contract, only\n     * the contract itself can withdraw its funds.\n     */\n    function withdraw(uint256 amount) public {\n        address payable account = msg.sender;\n        require(balances[account] >= amount, \"insufficient funds\");\n\n        balances[account] -= amount;\n        account.transfer(amount);\n\n        emit Withdrawn(account, amount);\n    }\n\n    function getNonce(address from) view external returns (uint256) {\n        return nonces[from];\n    }\n\n    function canUnstake(address relay) public view returns (bool) {\n        return relays[relay].unstakeTime > 0 && relays[relay].unstakeTime <= now;\n        // Finished the unstaking delay period?\n    }\n\n    function canRelay(\n        address relay,\n        address from,\n        address to,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    )\n    public view returns (uint256 status, bytes memory recipientContext)\n    {\n        // Verify the sender's signature on the transaction - note that approvalData is *not* signed\n        {\n            bytes memory packed = abi.encodePacked(\"rlx:\", from, to, encodedFunction, transactionFee, gasPrice, gasLimit, nonce, address(this));\n            bytes32 hashedMessage = keccak256(abi.encodePacked(packed, relay));\n\n            if (hashedMessage.toEthSignedMessageHash().recover(signature) != from) {\n                return (uint256(PreconditionCheck.WrongSignature), \"\");\n            }\n        }\n\n        // Verify the transaction is not being replayed\n        if (nonces[from] != nonce) {\n            return (uint256(PreconditionCheck.WrongNonce), \"\");\n        }\n\n        uint256 maxCharge = maxPossibleCharge(gasLimit, gasPrice, transactionFee);\n        bytes memory encodedTx = abi.encodeWithSelector(IRelayRecipient(to).acceptRelayedCall.selector,\n            relay, from, encodedFunction, transactionFee, gasPrice, gasLimit, nonce, approvalData, maxCharge\n        );\n\n        (bool success, bytes memory returndata) = to.staticcall.gas(acceptRelayedCallMaxGas)(encodedTx);\n\n        if (!success) {\n            return (uint256(PreconditionCheck.AcceptRelayedCallReverted), \"\");\n        } else {\n            (status, recipientContext) = abi.decode(returndata, (uint256, bytes));\n\n            // This can be either PreconditionCheck.OK or a custom error code\n            if ((status == 0) || (status > 10)) {\n                return (status, recipientContext);\n            } else {\n                // Error codes [1-10] are reserved to RelayHub\n                return (uint256(PreconditionCheck.InvalidRecipientStatusCode), \"\");\n            }\n        }\n    }\n\n    /**\n     * @notice Relay a transaction.\n     *\n     * @param from the client originating the request.\n     * @param recipient the target IRelayRecipient contract.\n     * @param encodedFunction the function call to relay.\n     * @param transactionFee fee (%) the relay takes over actual gas cost.\n     * @param gasPrice gas price the client is willing to pay\n     * @param gasLimit limit the client want to put on its transaction\n     * @param transactionFee fee (%) the relay takes over actual gas cost.\n     * @param nonce sender's nonce (in nonces[])\n     * @param signature client's signature over all params except approvalData\n     * @param approvalData dapp-specific data\n     */\n    function relayCall(\n        address from,\n        address recipient,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    )\n    public\n    {\n        uint256 initialGas = gasleft();\n\n        // Initial soundness checks - the relay must make sure these pass, or it will pay for a reverted transaction.\n\n        // The relay must be registered\n        require(relays[msg.sender].state == RelayState.Registered, \"Unknown relay\");\n\n        // A relay may use a higher gas price than the one requested by the signer (to e.g. get the transaction in a\n        // block faster), but it must not be lower. The recipient will be charged for the requested gas price, not the\n        // one used in the transaction.\n        require(gasPrice <= tx.gasprice, \"Invalid gas price\");\n\n        // This transaction must have enough gas to forward the call to the recipient with the requested amount, and not\n        // run out of gas later in this function.\n        require(initialGas >= SafeMath.sub(requiredGas(gasLimit), gasOverhead), \"Not enough gasleft()\");\n\n        // We don't yet know how much gas will be used by the recipient, so we make sure there are enough funds to pay\n        // for the maximum possible charge.\n        require(gasPrice * initialGas <= balances[recipient], \"Recipient balance too low\");\n\n        bytes4 functionSelector = LibBytes.readBytes4(encodedFunction, 0);\n\n        bytes memory recipientContext;\n        {\n            // We now verify the legitimacy of the transaction (it must be signed by the sender, and not be replayed),\n            // and that the recpient will accept to be charged by it.\n            uint256 preconditionCheck;\n            (preconditionCheck, recipientContext) = canRelay(msg.sender, from, recipient, encodedFunction, transactionFee, gasPrice, gasLimit, nonce, signature, approvalData);\n\n            if (preconditionCheck != uint256(PreconditionCheck.OK)) {\n                emit CanRelayFailed(msg.sender, from, recipient, functionSelector, preconditionCheck);\n                return;\n            }\n        }\n\n        // From this point on, this transaction will not revert nor run out of gas, and the recipient will be charged\n        // for the gas spent.\n\n        // The sender's nonce is advanced to prevent transaction replays.\n        nonces[from]++;\n\n        // Calls to the recipient are performed atomically inside an inner transaction which may revert in case of\n        // errors in the recipient. In either case (revert or regular execution) the return data encodes the\n        // RelayCallStatus value.\n        RelayCallStatus status;\n        {\n            uint256 preChecksGas = initialGas - gasleft();\n            bytes memory encodedFunctionWithFrom = abi.encodePacked(encodedFunction, from);\n            bytes memory data = abi.encodeWithSelector(this.recipientCallsAtomic.selector, recipient, encodedFunctionWithFrom, transactionFee, gasPrice, gasLimit, preChecksGas, recipientContext);\n            (, bytes memory relayCallStatus) = address(this).call(data);\n            status = abi.decode(relayCallStatus, (RelayCallStatus));\n        }\n\n        // We now perform the actual charge calculation, based on the measured gas used\n        uint256 charge = calculateCharge(\n            getChargeableGas(initialGas - gasleft(), false),\n            gasPrice,\n            transactionFee\n        );\n\n        // We've already checked that the recipient has enough balance to pay for the relayed transaction, this is only\n        // a sanity check to prevent overflows in case of bugs.\n        require(balances[recipient] >= charge, \"Should not get here\");\n        balances[recipient] -= charge;\n        balances[relays[msg.sender].owner] += charge;\n\n        emit TransactionRelayed(msg.sender, from, recipient, functionSelector, status, charge);\n    }\n\n    struct AtomicData {\n        uint256 atomicInitialGas;\n        uint256 balanceBefore;\n        bytes32 preReturnValue;\n        bool relayedCallSuccess;\n    }\n\n    function recipientCallsAtomic(\n        address recipient,\n        bytes calldata encodedFunctionWithFrom,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 preChecksGas,\n        bytes calldata recipientContext\n    )\n    external\n    returns (RelayCallStatus)\n    {\n        AtomicData memory atomicData;\n        atomicData.atomicInitialGas = gasleft(); // A new gas measurement is performed inside recipientCallsAtomic, since\n        // due to EIP150 available gas amounts cannot be directly compared across external calls\n\n        // This external function can only be called by RelayHub itself, creating an internal transaction. Calls to the\n        // recipient (preRelayedCall, the relayedCall, and postRelayedCall) are called from inside this transaction.\n        require(msg.sender == address(this), \"Only RelayHub should call this function\");\n\n        // If either pre or post reverts, the whole internal transaction will be reverted, reverting all side effects on\n        // the recipient. The recipient will still be charged for the used gas by the relay.\n\n        // The recipient is no allowed to withdraw balance from RelayHub during a relayed transaction. We check pre and\n        // post state to ensure this doesn't happen.\n        atomicData.balanceBefore = balances[recipient];\n\n        // First preRelayedCall is executed.\n        {\n            // Note: we open a new block to avoid growing the stack too much.\n            bytes memory data = abi.encodeWithSelector(\n                IRelayRecipient(recipient).preRelayedCall.selector, recipientContext\n            );\n\n            // preRelayedCall may revert, but the recipient will still be charged: it should ensure in\n            // acceptRelayedCall that this will not happen.\n            (bool success, bytes memory retData) = recipient.call.gas(preRelayedCallMaxGas)(data);\n\n            if (!success) {\n                revertWithStatus(RelayCallStatus.PreRelayedFailed);\n            }\n\n            atomicData.preReturnValue = abi.decode(retData, (bytes32));\n        }\n\n        // The actual relayed call is now executed. The sender's address is appended at the end of the transaction data\n        (atomicData.relayedCallSuccess,) = recipient.call.gas(gasLimit)(encodedFunctionWithFrom);\n\n        // Finally, postRelayedCall is executed, with the relayedCall execution's status and a charge estimate\n        {\n            bytes memory data;\n            {\n                // We now determine how much the recipient will be charged, to pass this value to postRelayedCall for accurate\n                // accounting.\n                uint256 estimatedCharge = calculateCharge(\n                    getChargeableGas(preChecksGas + atomicData.atomicInitialGas - gasleft(), true), // postRelayedCall is included in the charge\n                    gasPrice,\n                    transactionFee\n                );\n\n                data = abi.encodeWithSelector(\n                    IRelayRecipient(recipient).postRelayedCall.selector,\n                    recipientContext, atomicData.relayedCallSuccess, estimatedCharge, atomicData.preReturnValue\n                );\n            }\n\n            (bool successPost,) = recipient.call.gas(postRelayedCallMaxGas)(data);\n\n            if (!successPost) {\n                revertWithStatus(RelayCallStatus.PostRelayedFailed);\n            }\n        }\n\n        if (balances[recipient] < atomicData.balanceBefore) {\n            revertWithStatus(RelayCallStatus.RecipientBalanceChanged);\n        }\n\n        return atomicData.relayedCallSuccess ? RelayCallStatus.OK : RelayCallStatus.RelayedCallFailed;\n    }\n\n    /**\n     * @dev Reverts the transaction with returndata set to the ABI encoding of the status argument.\n     */\n    function revertWithStatus(RelayCallStatus status) private pure {\n        bytes memory data = abi.encode(status);\n\n        assembly {\n            let dataSize := mload(data)\n            let dataPtr := add(data, 32)\n\n            revert(dataPtr, dataSize)\n        }\n    }\n\n    function requiredGas(uint256 relayedCallStipend) public view returns (uint256) {\n        return gasOverhead + gasReserve + acceptRelayedCallMaxGas + preRelayedCallMaxGas + postRelayedCallMaxGas + relayedCallStipend;\n    }\n\n    function maxPossibleCharge(uint256 relayedCallStipend, uint256 gasPrice, uint256 transactionFee) public view returns (uint256) {\n        return calculateCharge(requiredGas(relayedCallStipend), gasPrice, transactionFee);\n    }\n\n    function calculateCharge(uint256 gas, uint256 gasPrice, uint256 fee) private pure returns (uint256) {\n        // The fee is expressed as a percentage. E.g. a value of 40 stands for a 40% fee, so the recipient will be\n        // charged for 1.4 times the spent amount.\n        return (gas * gasPrice * (100 + fee)) / 100;\n    }\n\n    function getChargeableGas(uint256 gasUsed, bool postRelayedCallEstimation) private pure returns (uint256) {\n        return gasOverhead + gasUsed + (postRelayedCallEstimation ? (postRelayedCallMaxGas + recipientCallsAtomicOverhead) : 0);\n    }\n\n    struct Transaction {\n        uint256 nonce;\n        uint256 gasPrice;\n        uint256 gasLimit;\n        address to;\n        uint256 value;\n        bytes data;\n    }\n\n    function decodeTransaction(bytes memory rawTransaction) private pure returns (Transaction memory transaction) {\n        (transaction.nonce, transaction.gasPrice, transaction.gasLimit, transaction.to, transaction.value, transaction.data) = RLPReader.decodeTransaction(rawTransaction);\n        return transaction;\n\n    }\n\n    function penalizeRepeatedNonce(bytes memory unsignedTx1, bytes memory signature1, bytes memory unsignedTx2, bytes memory signature2) public {\n        // Can be called by anyone.\n        // If a relay attacked the system by signing multiple transactions with the same nonce (so only one is accepted), anyone can grab both transactions from the blockchain and submit them here.\n        // Check whether unsignedTx1 != unsignedTx2, that both are signed by the same address, and that unsignedTx1.nonce == unsignedTx2.nonce.  If all conditions are met, relay is considered an \"offending relay\".\n        // The offending relay will be unregistered immediately, its stake will be forfeited and given to the address who reported it (msg.sender), thus incentivizing anyone to report offending relays.\n        // If reported via a relay, the forfeited stake is split between msg.sender (the relay used for reporting) and the address that reported it.\n\n        address addr1 = keccak256(abi.encodePacked(unsignedTx1)).recover(signature1);\n        address addr2 = keccak256(abi.encodePacked(unsignedTx2)).recover(signature2);\n\n        require(addr1 == addr2, \"Different signer\");\n\n        Transaction memory decodedTx1 = decodeTransaction(unsignedTx1);\n        Transaction memory decodedTx2 = decodeTransaction(unsignedTx2);\n\n        //checking that the same nonce is used in both transaction, with both signed by the same address and the actual data is different\n        // note: we compare the hash of the tx to save gas over iterating both byte arrays\n        require(decodedTx1.nonce == decodedTx2.nonce, \"Different nonce\");\n\n        bytes memory dataToCheck1 = abi.encodePacked(decodedTx1.data, decodedTx1.gasLimit, decodedTx1.to, decodedTx1.value);\n        bytes memory dataToCheck2 = abi.encodePacked(decodedTx2.data, decodedTx2.gasLimit, decodedTx2.to, decodedTx2.value);\n        require(keccak256(dataToCheck1) != keccak256(dataToCheck2), \"tx is equal\");\n\n        penalize(addr1);\n    }\n\n    function penalizeIllegalTransaction(bytes memory unsignedTx, bytes memory signature) public {\n        Transaction memory decodedTx = decodeTransaction(unsignedTx);\n        if (decodedTx.to == address(this)) {\n            bytes4 selector = GsnUtils.getMethodSig(decodedTx.data);\n            // Note: If RelayHub's relay API is extended, the selectors must be added to the ones listed here\n            require(selector != this.relayCall.selector && selector != this.registerRelay.selector, \"Legal relay transaction\");\n        }\n\n        address relay = keccak256(abi.encodePacked(unsignedTx)).recover(signature);\n\n        penalize(relay);\n    }\n\n    function penalize(address relay) private {\n        require((relays[relay].state == RelayState.Staked) ||\n        (relays[relay].state == RelayState.Registered) ||\n            (relays[relay].state == RelayState.Removed), \"Unstaked relay\");\n\n        // Half of the stake will be burned (sent to address 0)\n        uint256 totalStake = relays[relay].stake;\n        uint256 toBurn = SafeMath.div(totalStake, 2);\n        uint256 reward = SafeMath.sub(totalStake, toBurn);\n\n        if (relays[relay].state == RelayState.Registered) {\n            emit RelayRemoved(relay, now);\n        }\n\n        // The relay is deleted\n        delete relays[relay];\n\n        // Ether is burned and transferred\n        address(0).transfer(toBurn);\n        address payable reporter = msg.sender;\n        reporter.transfer(reward);\n\n        emit Penalized(relay, reporter, reward);\n    }\n}\n",
  "imports": [
    {
      "name": "RelayHub.sol",
      "contents": "// File: contracts/IRelayHub.sol\n\npragma solidity ^0.5.5;\n\ncontract IRelayHub {\n    // Relay management\n\n    // Add stake to a relay and sets its unstakeDelay.\n    // If the relay does not exist, it is created, and the caller\n    // of this function becomes its owner. If the relay already exists, only the owner can call this function. A relay\n    // cannot be its own owner.\n    // All Ether in this function call will be added to the relay's stake.\n    // Its unstake delay will be assigned to unstakeDelay, but the new value must be greater or equal to the current one.\n    // Emits a Staked event.\n    function stake(address relayaddr, uint256 unstakeDelay) external payable;\n\n    // Emited when a relay's stake or unstakeDelay are increased\n    event Staked(address indexed relay, uint256 stake, uint256 unstakeDelay);\n\n    // Registers the caller as a relay.\n    // The relay must be staked for, and not be a contract (i.e. this function must be called directly from an EOA).\n    // Emits a RelayAdded event.\n    // This function can be called multiple times, emitting new RelayAdded events. Note that the received transactionFee\n    // is not enforced by relayCall.\n    function registerRelay(uint256 transactionFee, string memory url) public;\n\n    // Emitted when a relay is registered or re-registerd. Looking at these events (and filtering out RelayRemoved\n    // events) lets a client discover the list of available relays.\n    event RelayAdded(address indexed relay, address indexed owner, uint256 transactionFee, uint256 stake, uint256 unstakeDelay, string url);\n\n    // Removes (deregisters) a relay. Unregistered (but staked for) relays can also be removed. Can only be called by\n    // the owner of the relay. After the relay's unstakeDelay has elapsed, unstake will be callable.\n    // Emits a RelayRemoved event.\n    function removeRelayByOwner(address relay) public;\n\n    // Emitted when a relay is removed (deregistered). unstakeTime is the time when unstake will be callable.\n    event RelayRemoved(address indexed relay, uint256 unstakeTime);\n\n    // Deletes the relay from the system, and gives back its stake to the owner. Can only be called by the relay owner,\n    // after unstakeDelay has elapsed since removeRelayByOwner was called.\n    // Emits an Unstaked event.\n    function unstake(address relay) public;\n\n    // Emitted when a relay is unstaked for, including the returned stake.\n    event Unstaked(address indexed relay, uint256 stake);\n\n    // States a relay can be in\n    enum RelayState {\n        Unknown, // The relay is unknown to the system: it has never been staked for\n        Staked, // The relay has been staked for, but it is not yet active\n        Registered, // The relay has registered itself, and is active (can relay calls)\n        Removed    // The relay has been removed by its owner and can no longer relay calls. It must wait for its unstakeDelay to elapse before it can unstake\n    }\n\n    // Returns a relay's status. Note that relays can be deleted when unstaked or penalized.\n    function getRelay(address relay) external view returns (uint256 totalStake, uint256 unstakeDelay, uint256 unstakeTime, address payable owner, RelayState state);\n\n    // Balance management\n\n    // Deposits ether for a contract, so that it can receive (and pay for) relayed transactions. Unused balance can only\n    // be withdrawn by the contract itself, by callingn withdraw.\n    // Emits a Deposited event.\n    function depositFor(address target) public payable;\n\n    // Emitted when depositFor is called, including the amount and account that was funded.\n    event Deposited(address indexed recipient, address indexed from, uint256 amount);\n\n    // Returns an account's deposits. These can be either a contnract's funds, or a relay owner's revenue.\n    function balanceOf(address target) external view returns (uint256);\n\n    // Withdraws from an account's balance, sending it back to it. Relay owners call this to retrieve their revenue, and\n    // contracts can also use it to reduce their funding.\n    // Emits a Withdrawn event.\n    function withdraw(uint256 amount) public;\n\n    // Emitted when an account withdraws funds from RelayHub.\n    event Withdrawn(address indexed dest, uint256 amount);\n\n    // Relaying\n\n    // Check if the RelayHub will accept a relayed operation. Multiple things must be true for this to happen:\n    //  - all arguments must be signed for by the sender (from)\n    //  - the sender's nonce must be the current one\n    //  - the recipient must accept this transaction (via acceptRelayedCall)\n    // Returns a PreconditionCheck value (OK when the transaction can be relayed), or a recipient-specific error code if\n    // it returns one in acceptRelayedCall.\n    function canRelay(\n        address relay,\n        address from,\n        address to,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    ) public view returns (uint256 status, bytes memory recipientContext);\n\n    // Preconditions for relaying, checked by canRelay and returned as the corresponding numeric values.\n    enum PreconditionCheck {\n        OK,                         // All checks passed, the call can be relayed\n        WrongSignature,             // The transaction to relay is not signed by requested sender\n        WrongNonce,                 // The provided nonce has already been used by the sender\n        AcceptRelayedCallReverted,  // The recipient rejected this call via acceptRelayedCall\n        InvalidRecipientStatusCode  // The recipient returned an invalid (reserved) status code\n    }\n\n    // Relays a transaction. For this to suceed, multiple conditions must be met:\n    //  - canRelay must return PreconditionCheck.OK\n    //  - the sender must be a registered relay\n    //  - the transaction's gas price must be larger or equal to the one that was requested by the sender\n    //  - the transaction must have enough gas to not run out of gas if all internal transactions (calls to the\n    // recipient) use all gas available to them\n    //  - the recipient must have enough balance to pay the relay for the worst-case scenario (i.e. when all gas is\n    // spent)\n    //\n    // If all conditions are met, the call will be relayed and the recipient charged. preRelayedCall, the encoded\n    // function and postRelayedCall will be called in order.\n    //\n    // Arguments:\n    //  - from: the client originating the request\n    //  - recipient: the target IRelayRecipient contract\n    //  - encodedFunction: the function call to relay, including data\n    //  - transactionFee: fee (%) the relay takes over actual gas cost\n    //  - gasPrice: gas price the client is willing to pay\n    //  - gasLimit: gas to forward when calling the encoded function\n    //  - nonce: client's nonce\n    //  - signature: client's signature over all previous params, plus the relay and RelayHub addresses\n    //  - approvalData: dapp-specific data forwared to acceptRelayedCall. This value is *not* verified by the Hub, but\n    //    it still can be used for e.g. a signature.\n    //\n    // Emits a TransactionRelayed event.\n    function relayCall(\n        address from,\n        address to,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    ) public;\n\n    // Emitted when an attempt to relay a call failed. This can happen due to incorrect relayCall arguments, or the\n    // recipient not accepting the relayed call. The actual relayed call was not executed, and the recipient not charged.\n    // The reason field contains an error code: values 1-10 correspond to PreconditionCheck entries, and values over 10\n    // are custom recipient error codes returned from acceptRelayedCall.\n    event CanRelayFailed(address indexed relay, address indexed from, address indexed to, bytes4 selector, uint256 reason);\n\n    // Emitted when a transaction is relayed. Note that the actual encoded function might be reverted: this will be\n    // indicated in the status field.\n    // Useful when monitoring a relay's operation and relayed calls to a contract.\n    // Charge is the ether value deducted from the recipient's balance, paid to the relay's owner.\n    event TransactionRelayed(address indexed relay, address indexed from, address indexed to, bytes4 selector, RelayCallStatus status, uint256 charge);\n\n    // Reason error codes for the TransactionRelayed event\n    enum RelayCallStatus {\n        OK,                      // The transaction was successfully relayed and execution successful - never included in the event\n        RelayedCallFailed,       // The transaction was relayed, but the relayed call failed\n        PreRelayedFailed,        // The transaction was not relayed due to preRelatedCall reverting\n        PostRelayedFailed,       // The transaction was relayed and reverted due to postRelatedCall reverting\n        RecipientBalanceChanged  // The transaction was relayed and reverted due to the recipient's balance changing\n    }\n\n    // Returns how much gas should be forwarded to a call to relayCall, in order to relay a transaction that will spend\n    // up to relayedCallStipend gas.\n    function requiredGas(uint256 relayedCallStipend) public view returns (uint256);\n\n    // Returns the maximum recipient charge, given the amount of gas forwarded, gas price and relay fee.\n    function maxPossibleCharge(uint256 relayedCallStipend, uint256 gasPrice, uint256 transactionFee) public view returns (uint256);\n\n    // Relay penalization. Any account can penalize relays, removing them from the system immediately, and rewarding the\n    // reporter with half of the relay's stake. The other half is burned so that, even if the relay penalizes itself, it\n    // still loses half of its stake.\n\n    // Penalize a relay that signed two transactions using the same nonce (making only the first one valid) and\n    // different data (gas price, gas limit, etc. may be different). The (unsigned) transaction data and signature for\n    // both transactions must be provided.\n    function penalizeRepeatedNonce(bytes memory unsignedTx1, bytes memory signature1, bytes memory unsignedTx2, bytes memory signature2) public;\n\n    // Penalize a relay that sent a transaction that didn't target RelayHub's registerRelay or relayCall.\n    function penalizeIllegalTransaction(bytes memory unsignedTx, bytes memory signature) public;\n\n    event Penalized(address indexed relay, address sender, uint256 amount);\n\n    function getNonce(address from) view external returns (uint256);\n}\n\n// File: contracts/IRelayRecipient.sol\n\npragma solidity ^0.5.5;\n\ncontract IRelayRecipient {\n\n    /**\n     * return the relayHub of this contract.\n     */\n    function getHubAddr() public view returns (address);\n\n    /**\n     * return the contract's balance on the RelayHub.\n     * can be used to determine if the contract can pay for incoming calls,\n     * before making any.\n     */\n    function getRecipientBalance() public view returns (uint);\n\n    /*\n     * Called by Relay (and RelayHub), to validate if this recipient accepts this call.\n     * Note: Accepting this call means paying for the tx whether the relayed call reverted or not.\n     *\n     *  @return \"0\" if the the contract is willing to accept the charges from this sender, for this function call.\n     *      any other value is a failure. actual value is for diagnostics only.\n     *      ** Note: values below 10 are reserved by canRelay\n\n     *  @param relay the relay that attempts to relay this function call.\n     *          the contract may restrict some encoded functions to specific known relays.\n     *  @param from the sender (signer) of this function call.\n     *  @param encodedFunction the encoded function call (without any ethereum signature).\n     *          the contract may check the method-id for valid methods\n     *  @param gasPrice - the gas price for this transaction\n     *  @param transactionFee - the relay compensation (in %) for this transaction\n     *  @param signature - sender's signature over all parameters except approvalData\n     *  @param approvalData - extra dapp-specific data (e.g. signature from trusted party)\n     */\n     function acceptRelayedCall(\n        address relay,\n        address from,\n        bytes calldata encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes calldata approvalData,\n        uint256 maxPossibleCharge\n    )\n    external\n    view\n    returns (uint256, bytes memory);\n\n    /*\n     * modifier to be used by recipients as access control protection for preRelayedCall & postRelayedCall\n     */\n    modifier relayHubOnly() {\n        require(msg.sender == getHubAddr(),\"Function can only be called by RelayHub\");\n        _;\n    }\n\n    /** this method is called before the actual relayed function call.\n     * It may be used to charge the caller before (in conjuction with refunding him later in postRelayedCall for example).\n     * the method is given all parameters of acceptRelayedCall and actual used gas.\n     *\n     *\n     *** NOTICE: if this method modifies the contract's state, it must be protected with access control i.e. require msg.sender == getHubAddr()\n     *\n     *\n     * Revert in this functions causes a revert of the client's relayed call but not in the entire transaction\n     * (that is, the relay will still get compensated)\n     */\n    function preRelayedCall(bytes calldata context) external returns (bytes32);\n\n    /** this method is called after the actual relayed function call.\n     * It may be used to record the transaction (e.g. charge the caller by some contract logic) for this call.\n     * the method is given all parameters of acceptRelayedCall, and also the success/failure status and actual used gas.\n     *\n     *\n     *** NOTICE: if this method modifies the contract's state, it must be protected with access control i.e. require msg.sender == getHubAddr()\n     *\n     *\n     * @param success - true if the relayed call succeeded, false if it reverted\n     * @param actualCharge - estimation of how much the recipient will be charged. This information may be used to perform local booking and\n     *   charge the sender for this call (e.g. in tokens).\n     * @param preRetVal - preRelayedCall() return value passed back to the recipient\n     *\n     * Revert in this functions causes a revert of the client's relayed call but not in the entire transaction\n     * (that is, the relay will still get compensated)\n     */\n    function postRelayedCall(bytes calldata context, bool success, uint actualCharge, bytes32 preRetVal) external;\n\n}\n\n// File: @0x/contracts-utils/contracts/src/LibBytes.sol\n\n/*\n\n  Copyright 2018 ZeroEx Intl.\n\n  Licensed under the Apache License, Version 2.0 (the \"License\");\n  you may not use this file except in compliance with the License.\n  You may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\n  Unless required by applicable law or agreed to in writing, software\n  distributed under the License is distributed on an \"AS IS\" BASIS,\n  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n  See the License for the specific language governing permissions and\n  limitations under the License.\n\n*/\n\npragma solidity ^0.5.5;\n\n\nlibrary LibBytes {\n\n    using LibBytes for bytes;\n\n    /// @dev Gets the memory address for a byte array.\n    /// @param input Byte array to lookup.\n    /// @return memoryAddress Memory address of byte array. This\n    ///         points to the header of the byte array which contains\n    ///         the length.\n    function rawAddress(bytes memory input)\n        internal\n        pure\n        returns (uint256 memoryAddress)\n    {\n        assembly {\n            memoryAddress := input\n        }\n        return memoryAddress;\n    }\n    \n    /// @dev Gets the memory address for the contents of a byte array.\n    /// @param input Byte array to lookup.\n    /// @return memoryAddress Memory address of the contents of the byte array.\n    function contentAddress(bytes memory input)\n        internal\n        pure\n        returns (uint256 memoryAddress)\n    {\n        assembly {\n            memoryAddress := add(input, 32)\n        }\n        return memoryAddress;\n    }\n\n    /// @dev Copies `length` bytes from memory location `source` to `dest`.\n    /// @param dest memory address to copy bytes to.\n    /// @param source memory address to copy bytes from.\n    /// @param length number of bytes to copy.\n    function memCopy(\n        uint256 dest,\n        uint256 source,\n        uint256 length\n    )\n        internal\n        pure\n    {\n        if (length < 32) {\n            // Handle a partial word by reading destination and masking\n            // off the bits we are interested in.\n            // This correctly handles overlap, zero lengths and source == dest\n            assembly {\n                let mask := sub(exp(256, sub(32, length)), 1)\n                let s := and(mload(source), not(mask))\n                let d := and(mload(dest), mask)\n                mstore(dest, or(s, d))\n            }\n        } else {\n            // Skip the O(length) loop when source == dest.\n            if (source == dest) {\n                return;\n            }\n\n            // For large copies we copy whole words at a time. The final\n            // word is aligned to the end of the range (instead of after the\n            // previous) to handle partial words. So a copy will look like this:\n            //\n            //  ####\n            //      ####\n            //          ####\n            //            ####\n            //\n            // We handle overlap in the source and destination range by\n            // changing the copying direction. This prevents us from\n            // overwriting parts of source that we still need to copy.\n            //\n            // This correctly handles source == dest\n            //\n            if (source > dest) {\n                assembly {\n                    // We subtract 32 from `sEnd` and `dEnd` because it\n                    // is easier to compare with in the loop, and these\n                    // are also the addresses we need for copying the\n                    // last bytes.\n                    length := sub(length, 32)\n                    let sEnd := add(source, length)\n                    let dEnd := add(dest, length)\n\n                    // Remember the last 32 bytes of source\n                    // This needs to be done here and not after the loop\n                    // because we may have overwritten the last bytes in\n                    // source already due to overlap.\n                    let last := mload(sEnd)\n\n                    // Copy whole words front to back\n                    // Note: the first check is always true,\n                    // this could have been a do-while loop.\n                    // solhint-disable-next-line no-empty-blocks\n                    for {} lt(source, sEnd) {} {\n                        mstore(dest, mload(source))\n                        source := add(source, 32)\n                        dest := add(dest, 32)\n                    }\n                    \n                    // Write the last 32 bytes\n                    mstore(dEnd, last)\n                }\n            } else {\n                assembly {\n                    // We subtract 32 from `sEnd` and `dEnd` because those\n                    // are the starting points when copying a word at the end.\n                    length := sub(length, 32)\n                    let sEnd := add(source, length)\n                    let dEnd := add(dest, length)\n\n                    // Remember the first 32 bytes of source\n                    // This needs to be done here and not after the loop\n                    // because we may have overwritten the first bytes in\n                    // source already due to overlap.\n                    let first := mload(source)\n\n                    // Copy whole words back to front\n                    // We use a signed comparisson here to allow dEnd to become\n                    // negative (happens when source and dest < 32). Valid\n                    // addresses in local memory will never be larger than\n                    // 2**255, so they can be safely re-interpreted as signed.\n                    // Note: the first check is always true,\n                    // this could have been a do-while loop.\n                    // solhint-disable-next-line no-empty-blocks\n                    for {} slt(dest, dEnd) {} {\n                        mstore(dEnd, mload(sEnd))\n                        sEnd := sub(sEnd, 32)\n                        dEnd := sub(dEnd, 32)\n                    }\n                    \n                    // Write the first 32 bytes\n                    mstore(dest, first)\n                }\n            }\n        }\n    }\n\n    /// @dev Returns a slices from a byte array.\n    /// @param b The byte array to take a slice from.\n    /// @param from The starting index for the slice (inclusive).\n    /// @param to The final index for the slice (exclusive).\n    /// @return result The slice containing bytes at indices [from, to)\n    function slice(\n        bytes memory b,\n        uint256 from,\n        uint256 to\n    )\n        internal\n        pure\n        returns (bytes memory result)\n    {\n        require(\n            from <= to,\n            \"FROM_LESS_THAN_TO_REQUIRED\"\n        );\n        require(\n            to <= b.length,\n            \"TO_LESS_THAN_LENGTH_REQUIRED\"\n        );\n        \n        // Create a new bytes structure and copy contents\n        result = new bytes(to - from);\n        memCopy(\n            result.contentAddress(),\n            b.contentAddress() + from,\n            result.length\n        );\n        return result;\n    }\n    \n    /// @dev Returns a slice from a byte array without preserving the input.\n    /// @param b The byte array to take a slice from. Will be destroyed in the process.\n    /// @param from The starting index for the slice (inclusive).\n    /// @param to The final index for the slice (exclusive).\n    /// @return result The slice containing bytes at indices [from, to)\n    /// @dev When `from == 0`, the original array will match the slice. In other cases its state will be corrupted.\n    function sliceDestructive(\n        bytes memory b,\n        uint256 from,\n        uint256 to\n    )\n        internal\n        pure\n        returns (bytes memory result)\n    {\n        require(\n            from <= to,\n            \"FROM_LESS_THAN_TO_REQUIRED\"\n        );\n        require(\n            to <= b.length,\n            \"TO_LESS_THAN_LENGTH_REQUIRED\"\n        );\n        \n        // Create a new bytes structure around [from, to) in-place.\n        assembly {\n            result := add(b, from)\n            mstore(result, sub(to, from))\n        }\n        return result;\n    }\n\n    /// @dev Pops the last byte off of a byte array by modifying its length.\n    /// @param b Byte array that will be modified.\n    /// @return The byte that was popped off.\n    function popLastByte(bytes memory b)\n        internal\n        pure\n        returns (bytes1 result)\n    {\n        require(\n            b.length > 0,\n            \"GREATER_THAN_ZERO_LENGTH_REQUIRED\"\n        );\n\n        // Store last byte.\n        result = b[b.length - 1];\n\n        assembly {\n            // Decrement length of byte array.\n            let newLen := sub(mload(b), 1)\n            mstore(b, newLen)\n        }\n        return result;\n    }\n\n    /// @dev Pops the last 20 bytes off of a byte array by modifying its length.\n    /// @param b Byte array that will be modified.\n    /// @return The 20 byte address that was popped off.\n    function popLast20Bytes(bytes memory b)\n        internal\n        pure\n        returns (address result)\n    {\n        require(\n            b.length >= 20,\n            \"GREATER_OR_EQUAL_TO_20_LENGTH_REQUIRED\"\n        );\n\n        // Store last 20 bytes.\n        result = readAddress(b, b.length - 20);\n\n        assembly {\n            // Subtract 20 from byte array length.\n            let newLen := sub(mload(b), 20)\n            mstore(b, newLen)\n        }\n        return result;\n    }\n\n    /// @dev Tests equality of two byte arrays.\n    /// @param lhs First byte array to compare.\n    /// @param rhs Second byte array to compare.\n    /// @return True if arrays are the same. False otherwise.\n    function equals(\n        bytes memory lhs,\n        bytes memory rhs\n    )\n        internal\n        pure\n        returns (bool equal)\n    {\n        // Keccak gas cost is 30 + numWords * 6. This is a cheap way to compare.\n        // We early exit on unequal lengths, but keccak would also correctly\n        // handle this.\n        return lhs.length == rhs.length && keccak256(lhs) == keccak256(rhs);\n    }\n\n    /// @dev Reads an address from a position in a byte array.\n    /// @param b Byte array containing an address.\n    /// @param index Index in byte array of address.\n    /// @return address from byte array.\n    function readAddress(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (address result)\n    {\n        require(\n            b.length >= index + 20,  // 20 is length of address\n            \"GREATER_OR_EQUAL_TO_20_LENGTH_REQUIRED\"\n        );\n\n        // Add offset to index:\n        // 1. Arrays are prefixed by 32-byte length parameter (add 32 to index)\n        // 2. Account for size difference between address length and 32-byte storage word (subtract 12 from index)\n        index += 20;\n\n        // Read address from array memory\n        assembly {\n            // 1. Add index to address of bytes array\n            // 2. Load 32-byte word from memory\n            // 3. Apply 20-byte mask to obtain address\n            result := and(mload(add(b, index)), 0xffffffffffffffffffffffffffffffffffffffff)\n        }\n        return result;\n    }\n\n    /// @dev Writes an address into a specific position in a byte array.\n    /// @param b Byte array to insert address into.\n    /// @param index Index in byte array of address.\n    /// @param input Address to put into byte array.\n    function writeAddress(\n        bytes memory b,\n        uint256 index,\n        address input\n    )\n        internal\n        pure\n    {\n        require(\n            b.length >= index + 20,  // 20 is length of address\n            \"GREATER_OR_EQUAL_TO_20_LENGTH_REQUIRED\"\n        );\n\n        // Add offset to index:\n        // 1. Arrays are prefixed by 32-byte length parameter (add 32 to index)\n        // 2. Account for size difference between address length and 32-byte storage word (subtract 12 from index)\n        index += 20;\n\n        // Store address into array memory\n        assembly {\n            // The address occupies 20 bytes and mstore stores 32 bytes.\n            // First fetch the 32-byte word where we'll be storing the address, then\n            // apply a mask so we have only the bytes in the word that the address will not occupy.\n            // Then combine these bytes with the address and store the 32 bytes back to memory with mstore.\n\n            // 1. Add index to address of bytes array\n            // 2. Load 32-byte word from memory\n            // 3. Apply 12-byte mask to obtain extra bytes occupying word of memory where we'll store the address\n            let neighbors := and(\n                mload(add(b, index)),\n                0xffffffffffffffffffffffff0000000000000000000000000000000000000000\n            )\n            \n            // Make sure input address is clean.\n            // (Solidity does not guarantee this)\n            input := and(input, 0xffffffffffffffffffffffffffffffffffffffff)\n\n            // Store the neighbors and address into memory\n            mstore(add(b, index), xor(input, neighbors))\n        }\n    }\n\n    /// @dev Reads a bytes32 value from a position in a byte array.\n    /// @param b Byte array containing a bytes32 value.\n    /// @param index Index in byte array of bytes32 value.\n    /// @return bytes32 value from byte array.\n    function readBytes32(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (bytes32 result)\n    {\n        require(\n            b.length >= index + 32,\n            \"GREATER_OR_EQUAL_TO_32_LENGTH_REQUIRED\"\n        );\n\n        // Arrays are prefixed by a 256 bit length parameter\n        index += 32;\n\n        // Read the bytes32 from array memory\n        assembly {\n            result := mload(add(b, index))\n        }\n        return result;\n    }\n\n    /// @dev Writes a bytes32 into a specific position in a byte array.\n    /// @param b Byte array to insert <input> into.\n    /// @param index Index in byte array of <input>.\n    /// @param input bytes32 to put into byte array.\n    function writeBytes32(\n        bytes memory b,\n        uint256 index,\n        bytes32 input\n    )\n        internal\n        pure\n    {\n        require(\n            b.length >= index + 32,\n            \"GREATER_OR_EQUAL_TO_32_LENGTH_REQUIRED\"\n        );\n\n        // Arrays are prefixed by a 256 bit length parameter\n        index += 32;\n\n        // Read the bytes32 from array memory\n        assembly {\n            mstore(add(b, index), input)\n        }\n    }\n\n    /// @dev Reads a uint256 value from a position in a byte array.\n    /// @param b Byte array containing a uint256 value.\n    /// @param index Index in byte array of uint256 value.\n    /// @return uint256 value from byte array.\n    function readUint256(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (uint256 result)\n    {\n        result = uint256(readBytes32(b, index));\n        return result;\n    }\n\n    /// @dev Writes a uint256 into a specific position in a byte array.\n    /// @param b Byte array to insert <input> into.\n    /// @param index Index in byte array of <input>.\n    /// @param input uint256 to put into byte array.\n    function writeUint256(\n        bytes memory b,\n        uint256 index,\n        uint256 input\n    )\n        internal\n        pure\n    {\n        writeBytes32(b, index, bytes32(input));\n    }\n\n    /// @dev Reads an unpadded bytes4 value from a position in a byte array.\n    /// @param b Byte array containing a bytes4 value.\n    /// @param index Index in byte array of bytes4 value.\n    /// @return bytes4 value from byte array.\n    function readBytes4(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (bytes4 result)\n    {\n        require(\n            b.length >= index + 4,\n            \"GREATER_OR_EQUAL_TO_4_LENGTH_REQUIRED\"\n        );\n\n        // Arrays are prefixed by a 32 byte length field\n        index += 32;\n\n        // Read the bytes4 from array memory\n        assembly {\n            result := mload(add(b, index))\n            // Solidity does not require us to clean the trailing bytes.\n            // We do it anyway\n            result := and(result, 0xFFFFFFFF00000000000000000000000000000000000000000000000000000000)\n        }\n        return result;\n    }\n\n    /// @dev Reads nested bytes from a specific position.\n    /// @dev NOTE: the returned value overlaps with the input value.\n    ///            Both should be treated as immutable.\n    /// @param b Byte array containing nested bytes.\n    /// @param index Index of nested bytes.\n    /// @return result Nested bytes.\n    function readBytesWithLength(\n        bytes memory b,\n        uint256 index\n    )\n        internal\n        pure\n        returns (bytes memory result)\n    {\n        // Read length of nested bytes\n        uint256 nestedBytesLength = readUint256(b, index);\n        index += 32;\n\n        // Assert length of <b> is valid, given\n        // length of nested bytes\n        require(\n            b.length >= index + nestedBytesLength,\n            \"GREATER_OR_EQUAL_TO_NESTED_BYTES_LENGTH_REQUIRED\"\n        );\n        \n        // Return a pointer to the byte array as it exists inside `b`\n        assembly {\n            result := add(b, index)\n        }\n        return result;\n    }\n\n    /// @dev Inserts bytes at a specific position in a byte array.\n    /// @param b Byte array to insert <input> into.\n    /// @param index Index in byte array of <input>.\n    /// @param input bytes to insert.\n    function writeBytesWithLength(\n        bytes memory b,\n        uint256 index,\n        bytes memory input\n    )\n        internal\n        pure\n    {\n        // Assert length of <b> is valid, given\n        // length of input\n        require(\n            b.length >= index + 32 + input.length,  // 32 bytes to store length\n            \"GREATER_OR_EQUAL_TO_NESTED_BYTES_LENGTH_REQUIRED\"\n        );\n\n        // Copy <input> into <b>\n        memCopy(\n            b.contentAddress() + index,\n            input.rawAddress(), // includes length of <input>\n            input.length + 32   // +32 bytes to store <input> length\n        );\n    }\n\n    /// @dev Performs a deep copy of a byte array onto another byte array of greater than or equal length.\n    /// @param dest Byte array that will be overwritten with source bytes.\n    /// @param source Byte array to copy onto dest bytes.\n    function deepCopyBytes(\n        bytes memory dest,\n        bytes memory source\n    )\n        internal\n        pure\n    {\n        uint256 sourceLen = source.length;\n        // Dest length must be >= source length, or some bytes would not be copied.\n        require(\n            dest.length >= sourceLen,\n            \"GREATER_OR_EQUAL_TO_SOURCE_BYTES_LENGTH_REQUIRED\"\n        );\n        memCopy(\n            dest.contentAddress(),\n            source.contentAddress(),\n            sourceLen\n        );\n    }\n}\n\n// File: contracts/GsnUtils.sol\n\npragma solidity ^0.5.5;\n\n\nlibrary GsnUtils {\n\n    /**\n     * extract method sig from encoded function call\n     */\n    function getMethodSig(bytes memory msgData) internal pure returns (bytes4) {\n        return bytes4(bytes32(LibBytes.readUint256(msgData, 0)));\n    }\n\n    /**\n     * extract parameter from encoded-function block.\n     * see: https://solidity.readthedocs.io/en/develop/abi-spec.html#formal-specification-of-the-encoding\n     * note that the type of the parameter must be static.\n     * the return value should be casted to the right type.\n     */\n    function getParam(bytes memory msgData, uint index) internal pure returns (uint) {\n        return LibBytes.readUint256(msgData, 4 + index * 32);\n    }\n\n    /**\n     * extract dynamic-sized (string/bytes) parameter.\n     * we assume that there ARE dynamic parameters, hence getParam(0) is the offset to the first\n     * dynamic param\n     * https://solidity.readthedocs.io/en/develop/abi-spec.html#use-of-dynamic-types\n     */\n    function getBytesParam(bytes memory msgData, uint index) internal pure returns (bytes memory ret)  {\n        uint ofs = getParam(msgData,index)+4;\n        uint len = LibBytes.readUint256(msgData, ofs);\n        ret = LibBytes.slice(msgData, ofs+32, ofs+32+len);\n    }\n\n    function getStringParam(bytes memory msgData, uint index) internal pure returns (string memory) {\n        return string(getBytesParam(msgData,index));\n    }\n\n    function checkSig(address signer, bytes32 hash, bytes memory sig) pure internal returns (bool) {\n        // Check if @v,@r,@s are a valid signature of @signer for @hash\n        uint8 v = uint8(sig[0]);\n        bytes32 r = LibBytes.readBytes32(sig,1);\n        bytes32 s = LibBytes.readBytes32(sig,33);\n        return signer == ecrecover(hash, v, r, s);\n    }\n}\n\n// File: contracts/RLPReader.sol\n\n/*\n* Taken from https://github.com/hamdiallam/Solidity-RLP\n*/\n\npragma solidity ^0.5.5;\n\nlibrary RLPReader {\n\n    uint8 constant STRING_SHORT_START = 0x80;\n    uint8 constant STRING_LONG_START = 0xb8;\n    uint8 constant LIST_SHORT_START = 0xc0;\n    uint8 constant LIST_LONG_START = 0xf8;\n    uint8 constant WORD_SIZE = 32;\n\n    struct RLPItem {\n        uint len;\n        uint memPtr;\n    }\n\n    using RLPReader for bytes;\n    using RLPReader for uint;\n    using RLPReader for RLPReader.RLPItem;\n\n    // helper function to decode rlp encoded  ethereum transaction\n    /*\n    * @param rawTransaction RLP encoded ethereum transaction\n    * @return tuple (nonce,gasPrice,gasLimit,to,value,data)\n    */\n\n    function decodeTransaction(bytes memory rawTransaction) internal pure returns (uint, uint, uint, address, uint, bytes memory){\n        RLPReader.RLPItem[] memory values = rawTransaction.toRlpItem().toList(); // must convert to an rlpItem first!\n        return (values[0].toUint(), values[1].toUint(), values[2].toUint(), values[3].toAddress(), values[4].toUint(), values[5].toBytes());\n    }\n\n    /*\n    * @param item RLP encoded bytes\n    */\n    function toRlpItem(bytes memory item) internal pure returns (RLPItem memory) {\n        if (item.length == 0)\n            return RLPItem(0, 0);\n        uint memPtr;\n        assembly {\n            memPtr := add(item, 0x20)\n        }\n        return RLPItem(item.length, memPtr);\n    }\n    /*\n    * @param item RLP encoded list in bytes\n    */\n    function toList(RLPItem memory item) internal pure returns (RLPItem[] memory result) {\n        require(isList(item), \"isList failed\");\n        uint items = numItems(item);\n        result = new RLPItem[](items);\n        uint memPtr = item.memPtr + _payloadOffset(item.memPtr);\n        uint dataLen;\n        for (uint i = 0; i < items; i++) {\n            dataLen = _itemLength(memPtr);\n            result[i] = RLPItem(dataLen, memPtr);\n            memPtr = memPtr + dataLen;\n        }\n    }\n    /*\n    * Helpers\n    */\n    // @return indicator whether encoded payload is a list. negate this function call for isData.\n    function isList(RLPItem memory item) internal pure returns (bool) {\n        uint8 byte0;\n        uint memPtr = item.memPtr;\n        assembly {\n            byte0 := byte(0, mload(memPtr))\n        }\n        if (byte0 < LIST_SHORT_START)\n            return false;\n        return true;\n    }\n    // @return number of payload items inside an encoded list.\n    function numItems(RLPItem memory item) internal pure returns (uint) {\n        uint count = 0;\n        uint currPtr = item.memPtr + _payloadOffset(item.memPtr);\n        uint endPtr = item.memPtr + item.len;\n        while (currPtr < endPtr) {\n            currPtr = currPtr + _itemLength(currPtr);\n            // skip over an item\n            count++;\n        }\n        return count;\n    }\n    // @return entire rlp item byte length\n    function _itemLength(uint memPtr) internal pure returns (uint len) {\n        uint byte0;\n        assembly {\n            byte0 := byte(0, mload(memPtr))\n        }\n        if (byte0 < STRING_SHORT_START)\n            return 1;\n        else if (byte0 < STRING_LONG_START)\n            return byte0 - STRING_SHORT_START + 1;\n        else if (byte0 < LIST_SHORT_START) {\n            assembly {\n                let byteLen := sub(byte0, 0xb7) // # of bytes the actual length is\n                memPtr := add(memPtr, 1) // skip over the first byte\n            /* 32 byte word size */\n                let dataLen := div(mload(memPtr), exp(256, sub(32, byteLen))) // right shifting to get the len\n                len := add(dataLen, add(byteLen, 1))\n            }\n        }\n        else if (byte0 < LIST_LONG_START) {\n            return byte0 - LIST_SHORT_START + 1;\n        }\n        else {\n            assembly {\n                let byteLen := sub(byte0, 0xf7)\n                memPtr := add(memPtr, 1)\n                let dataLen := div(mload(memPtr), exp(256, sub(32, byteLen))) // right shifting to the correct length\n                len := add(dataLen, add(byteLen, 1))\n            }\n        }\n    }\n    // @return number of bytes until the data\n    function _payloadOffset(uint memPtr) internal pure returns (uint) {\n        uint byte0;\n        assembly {\n            byte0 := byte(0, mload(memPtr))\n        }\n        if (byte0 < STRING_SHORT_START)\n            return 0;\n        else if (byte0 < STRING_LONG_START || (byte0 >= LIST_SHORT_START && byte0 < LIST_LONG_START))\n            return 1;\n        else if (byte0 < LIST_SHORT_START)  // being explicit\n            return byte0 - (STRING_LONG_START - 1) + 1;\n        else\n            return byte0 - (LIST_LONG_START - 1) + 1;\n    }\n    /** RLPItem conversions into data types **/\n    // @returns raw rlp encoding in bytes\n    function toRlpBytes(RLPItem memory item) internal pure returns (bytes memory) {\n        bytes memory result = new bytes(item.len);\n        uint ptr;\n        assembly {\n            ptr := add(0x20, result)\n        }\n        copy(item.memPtr, ptr, item.len);\n        return result;\n    }\n\n    function toBoolean(RLPItem memory item) internal pure returns (bool) {\n        require(item.len == 1, \"Invalid RLPItem. Booleans are encoded in 1 byte\");\n        uint result;\n        uint memPtr = item.memPtr;\n        assembly {\n            result := byte(0, mload(memPtr))\n        }\n        return result == 0 ? false : true;\n    }\n\n    function toAddress(RLPItem memory item) internal pure returns (address) {\n        // 1 byte for the length prefix according to RLP spec\n        require(item.len <= 21, \"Invalid RLPItem. Addresses are encoded in 20 bytes or less\");\n        return address(toUint(item));\n    }\n\n    function toUint(RLPItem memory item) internal pure returns (uint) {\n        uint offset = _payloadOffset(item.memPtr);\n        uint len = item.len - offset;\n        uint memPtr = item.memPtr + offset;\n        uint result;\n        assembly {\n            result := div(mload(memPtr), exp(256, sub(32, len))) // shift to the correct location\n        }\n        return result;\n    }\n\n    function toBytes(RLPItem memory item) internal pure returns (bytes memory) {\n        uint offset = _payloadOffset(item.memPtr);\n        uint len = item.len - offset;\n        // data length\n        bytes memory result = new bytes(len);\n        uint destPtr;\n        assembly {\n            destPtr := add(0x20, result)\n        }\n        copy(item.memPtr + offset, destPtr, len);\n        return result;\n    }\n    /*\n    * @param src Pointer to source\n    * @param dest Pointer to destination\n    * @param len Amount of memory to copy from the source\n    */\n    function copy(uint src, uint dest, uint len) internal pure {\n        // copy as many word sizes as possible\n        for (; len >= WORD_SIZE; len -= WORD_SIZE) {\n            assembly {\n                mstore(dest, mload(src))\n            }\n            src += WORD_SIZE;\n            dest += WORD_SIZE;\n        }\n        // left over bytes. Mask is used to remove unwanted bytes from the word\n        uint mask = 256 ** (WORD_SIZE - len) - 1;\n        assembly {\n            let srcpart := and(mload(src), not(mask)) // zero out src\n            let destpart := and(mload(dest), mask) // retrieve the bytes\n            mstore(dest, or(destpart, srcpart))\n        }\n    }\n}\n\n// File: openzeppelin-solidity/contracts/math/SafeMath.sol\n\npragma solidity ^0.5.0;\n\n/**\n * @dev Wrappers over Solidity's arithmetic operations with added overflow\n * checks.\n *\n * Arithmetic operations in Solidity wrap on overflow. This can easily result\n * in bugs, because programmers usually assume that an overflow raises an\n * error, which is the standard behavior in high level programming languages.\n * `SafeMath` restores this intuition by reverting the transaction when an\n * operation overflows.\n *\n * Using this library instead of the unchecked operations eliminates an entire\n * class of bugs, so it's recommended to use it always.\n */\nlibrary SafeMath {\n    /**\n     * @dev Returns the addition of two unsigned integers, reverting on\n     * overflow.\n     *\n     * Counterpart to Solidity's `+` operator.\n     *\n     * Requirements:\n     * - Addition cannot overflow.\n     */\n    function add(uint256 a, uint256 b) internal pure returns (uint256) {\n        uint256 c = a + b;\n        require(c >= a, \"SafeMath: addition overflow\");\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the subtraction of two unsigned integers, reverting on\n     * overflow (when the result is negative).\n     *\n     * Counterpart to Solidity's `-` operator.\n     *\n     * Requirements:\n     * - Subtraction cannot overflow.\n     */\n    function sub(uint256 a, uint256 b) internal pure returns (uint256) {\n        require(b <= a, \"SafeMath: subtraction overflow\");\n        uint256 c = a - b;\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the multiplication of two unsigned integers, reverting on\n     * overflow.\n     *\n     * Counterpart to Solidity's `*` operator.\n     *\n     * Requirements:\n     * - Multiplication cannot overflow.\n     */\n    function mul(uint256 a, uint256 b) internal pure returns (uint256) {\n        // Gas optimization: this is cheaper than requiring 'a' not being zero, but the\n        // benefit is lost if 'b' is also tested.\n        // See: https://github.com/OpenZeppelin/openzeppelin-solidity/pull/522\n        if (a == 0) {\n            return 0;\n        }\n\n        uint256 c = a * b;\n        require(c / a == b, \"SafeMath: multiplication overflow\");\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the integer division of two unsigned integers. Reverts on\n     * division by zero. The result is rounded towards zero.\n     *\n     * Counterpart to Solidity's `/` operator. Note: this function uses a\n     * `revert` opcode (which leaves remaining gas untouched) while Solidity\n     * uses an invalid opcode to revert (consuming all remaining gas).\n     *\n     * Requirements:\n     * - The divisor cannot be zero.\n     */\n    function div(uint256 a, uint256 b) internal pure returns (uint256) {\n        // Solidity only automatically asserts when dividing by 0\n        require(b > 0, \"SafeMath: division by zero\");\n        uint256 c = a / b;\n        // assert(a == b * c + a % b); // There is no case in which this doesn't hold\n\n        return c;\n    }\n\n    /**\n     * @dev Returns the remainder of dividing two unsigned integers. (unsigned integer modulo),\n     * Reverts when dividing by zero.\n     *\n     * Counterpart to Solidity's `%` operator. This function uses a `revert`\n     * opcode (which leaves remaining gas untouched) while Solidity uses an\n     * invalid opcode to revert (consuming all remaining gas).\n     *\n     * Requirements:\n     * - The divisor cannot be zero.\n     */\n    function mod(uint256 a, uint256 b) internal pure returns (uint256) {\n        require(b != 0, \"SafeMath: modulo by zero\");\n        return a % b;\n    }\n}\n\n// File: openzeppelin-solidity/contracts/cryptography/ECDSA.sol\n\npragma solidity ^0.5.0;\n\n/**\n * @dev Elliptic Curve Digital Signature Algorithm (ECDSA) operations.\n *\n * These functions can be used to verify that a message was signed by the holder\n * of the private keys of a given address.\n */\nlibrary ECDSA {\n    /**\n     * @dev Returns the address that signed a hashed message (`hash`) with\n     * `signature`. This address can then be used for verification purposes.\n     *\n     * The `ecrecover` EVM opcode allows for malleable (non-unique) signatures:\n     * this function rejects them by requiring the `s` value to be in the lower\n     * half order, and the `v` value to be either 27 or 28.\n     *\n     * (.note) This call _does not revert_ if the signature is invalid, or\n     * if the signer is otherwise unable to be retrieved. In those scenarios,\n     * the zero address is returned.\n     *\n     * (.warning) `hash` _must_ be the result of a hash operation for the\n     * verification to be secure: it is possible to craft signatures that\n     * recover to arbitrary addresses for non-hashed data. A safe way to ensure\n     * this is by receiving a hash of the original message (which may otherwise)\n     * be too long), and then calling `toEthSignedMessageHash` on it.\n     */\n    function recover(bytes32 hash, bytes memory signature) internal pure returns (address) {\n        // Check the signature length\n        if (signature.length != 65) {\n            return (address(0));\n        }\n\n        // Divide the signature in r, s and v variables\n        bytes32 r;\n        bytes32 s;\n        uint8 v;\n\n        // ecrecover takes the signature parameters, and the only way to get them\n        // currently is to use assembly.\n        // solhint-disable-next-line no-inline-assembly\n        assembly {\n            r := mload(add(signature, 0x20))\n            s := mload(add(signature, 0x40))\n            v := byte(0, mload(add(signature, 0x60)))\n        }\n\n        // EIP-2 still allows signature malleability for ecrecover(). Remove this possibility and make the signature\n        // unique. Appendix F in the Ethereum Yellow paper (https://ethereum.github.io/yellowpaper/paper.pdf), defines\n        // the valid range for s in (281): 0 < s < secp256k1n  2 + 1, and for v in (282): v  {27, 28}. Most\n        // signatures from current libraries generate a unique signature with an s-value in the lower half order.\n        //\n        // If your library generates malleable signatures, such as s-values in the upper range, calculate a new s-value\n        // with 0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEBAAEDCE6AF48A03BBFD25E8CD0364141 - s1 and flip v from 27 to 28 or\n        // vice versa. If your library also generates signatures with 0/1 for v instead 27/28, add 27 to v to accept\n        // these malleable signatures as well.\n        if (uint256(s) > 0x7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF5D576E7357A4501DDFE92F46681B20A0) {\n            return address(0);\n        }\n\n        if (v != 27 && v != 28) {\n            return address(0);\n        }\n\n        // If the signature is valid (and not malleable), return the signer address\n        return ecrecover(hash, v, r, s);\n    }\n\n    /**\n     * @dev Returns an Ethereum Signed Message, created from a `hash`. This\n     * replicates the behavior of the\n     * [`eth_sign`](https://github.com/ethereum/wiki/wiki/JSON-RPC#eth_sign)\n     * JSON-RPC method.\n     *\n     * See `recover`.\n     */\n    function toEthSignedMessageHash(bytes32 hash) internal pure returns (bytes32) {\n        // 32 is the length in bytes of hash,\n        // enforced by the type signature above\n        return keccak256(abi.encodePacked(\"\\x19Ethereum Signed Message:\\n32\", hash));\n    }\n}\n\n// File: contracts/RelayHub.sol\n\npragma solidity ^0.5.5;\n\n\n\n\n\n\n\n\ncontract RelayHub is IRelayHub {\n    using ECDSA for bytes32;\n\n    // IMPORTANT: RSK-related adjustments\n    // The original minimumStake, minimumRelayBalance and maximumRecipientDeposit\n    // were adjusted to reflect an estimated equivalence of 1 Ether = 0.02 RBTC\n    // This is so that running a relayer is not significatively more expensive\n    // on RSK given the value of a Bitcoin is *higher* than that of an Ether.\n\n    // Minimum stake a relay can have. An attack to the network will never cost less than half this value.\n    uint256 constant private minimumStake = 0.02 ether;\n\n    // Minimum unstake delay. A relay needs to wait for this time to elapse after deregistering to retrieve its stake.\n    uint256 constant private minimumUnstakeDelay = 1 weeks;\n    // Maximum unstake delay. Prevents relays from locking their funds into the RelayHub for too long.\n    uint256 constant private maximumUnstakeDelay = 12 weeks;\n\n    // Minimum balance required for a relay to register or re-register. Prevents user error in registering a relay that\n    // will not be able to immediatly start serving requests.\n    uint256 constant private minimumRelayBalance = 0.002 ether;\n\n    // Maximum funds that can be deposited at once. Prevents user error by disallowing large deposits.\n    uint256 constant private maximumRecipientDeposit = 0.04 ether;\n\n    /**\n    * the total gas overhead of relayCall(), before the first gasleft() and after the last gasleft().\n    * Assume that relay has non-zero balance (costs 15'000 more otherwise).\n    */\n\n    // Gas cost of all relayCall() instructions before first gasleft() and after last gasleft()\n    uint256 constant private gasOverhead = 48204;\n\n    // Gas cost of all relayCall() instructions after first gasleft() and before last gasleft()\n    uint256 constant private gasReserve = 100000;\n\n    // Approximation of how much calling recipientCallsAtomic costs\n    uint256 constant private recipientCallsAtomicOverhead = 5000;\n\n    // Gas stipends for acceptRelayedCall, preRelayedCall and postRelayedCall\n    uint256 constant private acceptRelayedCallMaxGas = 50000;\n    uint256 constant private preRelayedCallMaxGas = 100000;\n    uint256 constant private postRelayedCallMaxGas = 100000;\n\n    // Nonces of senders, used to prevent replay attacks\n    mapping(address => uint256) private nonces;\n\n    enum AtomicRecipientCallsStatus {OK, CanRelayFailed, RelayedCallFailed, PreRelayedFailed, PostRelayedFailed}\n\n    struct Relay {\n        uint256 stake;          // Ether staked for this relay\n        uint256 unstakeDelay;   // Time that must elapse before the owner can retrieve the stake after calling remove\n        uint256 unstakeTime;    // Time when unstake will be callable. A value of zero indicates the relay has not been removed.\n        address payable owner;  // Relay's owner, will receive revenue and manage it (call stake, remove and unstake).\n        RelayState state;\n    }\n\n    mapping(address => Relay) private relays;\n    mapping(address => uint256) private balances;\n\n    string public version = \"1.0.0\";\n\n    function stake(address relay, uint256 unstakeDelay) external payable {\n        if (relays[relay].state == RelayState.Unknown) {\n            require(msg.sender != relay, \"relay cannot stake for itself\");\n            relays[relay].owner = msg.sender;\n            relays[relay].state = RelayState.Staked;\n\n        } else if ((relays[relay].state == RelayState.Staked) || (relays[relay].state == RelayState.Registered)) {\n            require(relays[relay].owner == msg.sender, \"not owner\");\n\n        } else {\n            revert('wrong state for stake');\n        }\n\n        // Increase the stake\n\n        uint256 addedStake = msg.value;\n        relays[relay].stake += addedStake;\n\n        // The added stake may be e.g. zero when only the unstake delay is being updated\n        require(relays[relay].stake >= minimumStake, \"stake lower than minimum\");\n\n        // Increase the unstake delay\n\n        require(unstakeDelay >= minimumUnstakeDelay, \"delay lower than minimum\");\n        require(unstakeDelay <= maximumUnstakeDelay, \"delay higher than maximum\");\n\n        require(unstakeDelay >= relays[relay].unstakeDelay, \"unstakeDelay cannot be decreased\");\n        relays[relay].unstakeDelay = unstakeDelay;\n\n        emit Staked(relay, relays[relay].stake, relays[relay].unstakeDelay);\n    }\n\n    function registerRelay(uint256 transactionFee, string memory url) public {\n        address relay = msg.sender;\n\n        require(relay == tx.origin, \"Contracts cannot register as relays\");\n        require(relays[relay].state == RelayState.Staked || relays[relay].state == RelayState.Registered, \"wrong state for stake\");\n        require(relay.balance >= minimumRelayBalance, \"balance lower than minimum\");\n\n        if (relays[relay].state != RelayState.Registered) {\n            relays[relay].state = RelayState.Registered;\n        }\n\n        emit RelayAdded(relay, relays[relay].owner, transactionFee, relays[relay].stake, relays[relay].unstakeDelay, url);\n    }\n\n    function removeRelayByOwner(address relay) public {\n        require(relays[relay].owner == msg.sender, \"not owner\");\n        require((relays[relay].state == RelayState.Staked) || (relays[relay].state == RelayState.Registered), \"already removed\");\n\n        // Start the unstake counter\n        relays[relay].unstakeTime = relays[relay].unstakeDelay + now;\n        relays[relay].state = RelayState.Removed;\n\n        emit RelayRemoved(relay, relays[relay].unstakeTime);\n    }\n\n    function unstake(address relay) public {\n        require(canUnstake(relay), \"canUnstake failed\");\n        require(relays[relay].owner == msg.sender, \"not owner\");\n\n        address payable owner = msg.sender;\n        uint256 amount = relays[relay].stake;\n\n        delete relays[relay];\n\n        owner.transfer(amount);\n        emit Unstaked(relay, amount);\n    }\n\n    function getRelay(address relay) external view returns (uint256 totalStake, uint256 unstakeDelay, uint256 unstakeTime, address payable owner, RelayState state) {\n        totalStake = relays[relay].stake;\n        unstakeDelay = relays[relay].unstakeDelay;\n        unstakeTime = relays[relay].unstakeTime;\n        owner = relays[relay].owner;\n        state = relays[relay].state;\n    }\n\n    /**\n     * deposit ether for a contract.\n     * This ether will be used to repay relay calls into this contract.\n     * Contract owner should monitor the balance of his contract, and make sure\n     * to deposit more, otherwise the contract won't be able to receive relayed calls.\n     * Unused deposited can be withdrawn with `withdraw()`\n     */\n    function depositFor(address target) public payable {\n        uint256 amount = msg.value;\n        require(amount <= maximumRecipientDeposit, \"deposit too big\");\n\n        balances[target] = SafeMath.add(balances[target], amount);\n\n        emit Deposited(target, msg.sender, amount);\n    }\n\n    //check the deposit balance of a contract.\n    function balanceOf(address target) external view returns (uint256) {\n        return balances[target];\n    }\n\n    /**\n     * withdraw funds.\n     * caller is either a relay owner, withdrawing collected transaction fees.\n     * or a IRelayRecipient contract, withdrawing its deposit.\n     * note that while everyone can `depositFor()` a contract, only\n     * the contract itself can withdraw its funds.\n     */\n    function withdraw(uint256 amount) public {\n        address payable account = msg.sender;\n        require(balances[account] >= amount, \"insufficient funds\");\n\n        balances[account] -= amount;\n        account.transfer(amount);\n\n        emit Withdrawn(account, amount);\n    }\n\n    function getNonce(address from) view external returns (uint256) {\n        return nonces[from];\n    }\n\n    function canUnstake(address relay) public view returns (bool) {\n        return relays[relay].unstakeTime > 0 && relays[relay].unstakeTime <= now;\n        // Finished the unstaking delay period?\n    }\n\n    function canRelay(\n        address relay,\n        address from,\n        address to,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    )\n    public view returns (uint256 status, bytes memory recipientContext)\n    {\n        // Verify the sender's signature on the transaction - note that approvalData is *not* signed\n        {\n            bytes memory packed = abi.encodePacked(\"rlx:\", from, to, encodedFunction, transactionFee, gasPrice, gasLimit, nonce, address(this));\n            bytes32 hashedMessage = keccak256(abi.encodePacked(packed, relay));\n\n            if (hashedMessage.toEthSignedMessageHash().recover(signature) != from) {\n                return (uint256(PreconditionCheck.WrongSignature), \"\");\n            }\n        }\n\n        // Verify the transaction is not being replayed\n        if (nonces[from] != nonce) {\n            return (uint256(PreconditionCheck.WrongNonce), \"\");\n        }\n\n        uint256 maxCharge = maxPossibleCharge(gasLimit, gasPrice, transactionFee);\n        bytes memory encodedTx = abi.encodeWithSelector(IRelayRecipient(to).acceptRelayedCall.selector,\n            relay, from, encodedFunction, transactionFee, gasPrice, gasLimit, nonce, approvalData, maxCharge\n        );\n\n        (bool success, bytes memory returndata) = to.staticcall.gas(acceptRelayedCallMaxGas)(encodedTx);\n\n        if (!success) {\n            return (uint256(PreconditionCheck.AcceptRelayedCallReverted), \"\");\n        } else {\n            (status, recipientContext) = abi.decode(returndata, (uint256, bytes));\n\n            // This can be either PreconditionCheck.OK or a custom error code\n            if ((status == 0) || (status > 10)) {\n                return (status, recipientContext);\n            } else {\n                // Error codes [1-10] are reserved to RelayHub\n                return (uint256(PreconditionCheck.InvalidRecipientStatusCode), \"\");\n            }\n        }\n    }\n\n    /**\n     * @notice Relay a transaction.\n     *\n     * @param from the client originating the request.\n     * @param recipient the target IRelayRecipient contract.\n     * @param encodedFunction the function call to relay.\n     * @param transactionFee fee (%) the relay takes over actual gas cost.\n     * @param gasPrice gas price the client is willing to pay\n     * @param gasLimit limit the client want to put on its transaction\n     * @param transactionFee fee (%) the relay takes over actual gas cost.\n     * @param nonce sender's nonce (in nonces[])\n     * @param signature client's signature over all params except approvalData\n     * @param approvalData dapp-specific data\n     */\n    function relayCall(\n        address from,\n        address recipient,\n        bytes memory encodedFunction,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 nonce,\n        bytes memory signature,\n        bytes memory approvalData\n    )\n    public\n    {\n        uint256 initialGas = gasleft();\n\n        // Initial soundness checks - the relay must make sure these pass, or it will pay for a reverted transaction.\n\n        // The relay must be registered\n        require(relays[msg.sender].state == RelayState.Registered, \"Unknown relay\");\n\n        // A relay may use a higher gas price than the one requested by the signer (to e.g. get the transaction in a\n        // block faster), but it must not be lower. The recipient will be charged for the requested gas price, not the\n        // one used in the transaction.\n        require(gasPrice <= tx.gasprice, \"Invalid gas price\");\n\n        // This transaction must have enough gas to forward the call to the recipient with the requested amount, and not\n        // run out of gas later in this function.\n        require(initialGas >= SafeMath.sub(requiredGas(gasLimit), gasOverhead), \"Not enough gasleft()\");\n\n        // We don't yet know how much gas will be used by the recipient, so we make sure there are enough funds to pay\n        // for the maximum possible charge.\n        require(gasPrice * initialGas <= balances[recipient], \"Recipient balance too low\");\n\n        bytes4 functionSelector = LibBytes.readBytes4(encodedFunction, 0);\n\n        bytes memory recipientContext;\n        {\n            // We now verify the legitimacy of the transaction (it must be signed by the sender, and not be replayed),\n            // and that the recpient will accept to be charged by it.\n            uint256 preconditionCheck;\n            (preconditionCheck, recipientContext) = canRelay(msg.sender, from, recipient, encodedFunction, transactionFee, gasPrice, gasLimit, nonce, signature, approvalData);\n\n            if (preconditionCheck != uint256(PreconditionCheck.OK)) {\n                emit CanRelayFailed(msg.sender, from, recipient, functionSelector, preconditionCheck);\n                return;\n            }\n        }\n\n        // From this point on, this transaction will not revert nor run out of gas, and the recipient will be charged\n        // for the gas spent.\n\n        // The sender's nonce is advanced to prevent transaction replays.\n        nonces[from]++;\n\n        // Calls to the recipient are performed atomically inside an inner transaction which may revert in case of\n        // errors in the recipient. In either case (revert or regular execution) the return data encodes the\n        // RelayCallStatus value.\n        RelayCallStatus status;\n        {\n            uint256 preChecksGas = initialGas - gasleft();\n            bytes memory encodedFunctionWithFrom = abi.encodePacked(encodedFunction, from);\n            bytes memory data = abi.encodeWithSelector(this.recipientCallsAtomic.selector, recipient, encodedFunctionWithFrom, transactionFee, gasPrice, gasLimit, preChecksGas, recipientContext);\n            (, bytes memory relayCallStatus) = address(this).call(data);\n            status = abi.decode(relayCallStatus, (RelayCallStatus));\n        }\n\n        // We now perform the actual charge calculation, based on the measured gas used\n        uint256 charge = calculateCharge(\n            getChargeableGas(initialGas - gasleft(), false),\n            gasPrice,\n            transactionFee\n        );\n\n        // We've already checked that the recipient has enough balance to pay for the relayed transaction, this is only\n        // a sanity check to prevent overflows in case of bugs.\n        require(balances[recipient] >= charge, \"Should not get here\");\n        balances[recipient] -= charge;\n        balances[relays[msg.sender].owner] += charge;\n\n        emit TransactionRelayed(msg.sender, from, recipient, functionSelector, status, charge);\n    }\n\n    struct AtomicData {\n        uint256 atomicInitialGas;\n        uint256 balanceBefore;\n        bytes32 preReturnValue;\n        bool relayedCallSuccess;\n    }\n\n    function recipientCallsAtomic(\n        address recipient,\n        bytes calldata encodedFunctionWithFrom,\n        uint256 transactionFee,\n        uint256 gasPrice,\n        uint256 gasLimit,\n        uint256 preChecksGas,\n        bytes calldata recipientContext\n    )\n    external\n    returns (RelayCallStatus)\n    {\n        AtomicData memory atomicData;\n        atomicData.atomicInitialGas = gasleft(); // A new gas measurement is performed inside recipientCallsAtomic, since\n        // due to EIP150 available gas amounts cannot be directly compared across external calls\n\n        // This external function can only be called by RelayHub itself, creating an internal transaction. Calls to the\n        // recipient (preRelayedCall, the relayedCall, and postRelayedCall) are called from inside this transaction.\n        require(msg.sender == address(this), \"Only RelayHub should call this function\");\n\n        // If either pre or post reverts, the whole internal transaction will be reverted, reverting all side effects on\n        // the recipient. The recipient will still be charged for the used gas by the relay.\n\n        // The recipient is no allowed to withdraw balance from RelayHub during a relayed transaction. We check pre and\n        // post state to ensure this doesn't happen.\n        atomicData.balanceBefore = balances[recipient];\n\n        // First preRelayedCall is executed.\n        {\n            // Note: we open a new block to avoid growing the stack too much.\n            bytes memory data = abi.encodeWithSelector(\n                IRelayRecipient(recipient).preRelayedCall.selector, recipientContext\n            );\n\n            // preRelayedCall may revert, but the recipient will still be charged: it should ensure in\n            // acceptRelayedCall that this will not happen.\n            (bool success, bytes memory retData) = recipient.call.gas(preRelayedCallMaxGas)(data);\n\n            if (!success) {\n                revertWithStatus(RelayCallStatus.PreRelayedFailed);\n            }\n\n            atomicData.preReturnValue = abi.decode(retData, (bytes32));\n        }\n\n        // The actual relayed call is now executed. The sender's address is appended at the end of the transaction data\n        (atomicData.relayedCallSuccess,) = recipient.call.gas(gasLimit)(encodedFunctionWithFrom);\n\n        // Finally, postRelayedCall is executed, with the relayedCall execution's status and a charge estimate\n        {\n            bytes memory data;\n            {\n                // We now determine how much the recipient will be charged, to pass this value to postRelayedCall for accurate\n                // accounting.\n                uint256 estimatedCharge = calculateCharge(\n                    getChargeableGas(preChecksGas + atomicData.atomicInitialGas - gasleft(), true), // postRelayedCall is included in the charge\n                    gasPrice,\n                    transactionFee\n                );\n\n                data = abi.encodeWithSelector(\n                    IRelayRecipient(recipient).postRelayedCall.selector,\n                    recipientContext, atomicData.relayedCallSuccess, estimatedCharge, atomicData.preReturnValue\n                );\n            }\n\n            (bool successPost,) = recipient.call.gas(postRelayedCallMaxGas)(data);\n\n            if (!successPost) {\n                revertWithStatus(RelayCallStatus.PostRelayedFailed);\n            }\n        }\n\n        if (balances[recipient] < atomicData.balanceBefore) {\n            revertWithStatus(RelayCallStatus.RecipientBalanceChanged);\n        }\n\n        return atomicData.relayedCallSuccess ? RelayCallStatus.OK : RelayCallStatus.RelayedCallFailed;\n    }\n\n    /**\n     * @dev Reverts the transaction with returndata set to the ABI encoding of the status argument.\n     */\n    function revertWithStatus(RelayCallStatus status) private pure {\n        bytes memory data = abi.encode(status);\n\n        assembly {\n            let dataSize := mload(data)\n            let dataPtr := add(data, 32)\n\n            revert(dataPtr, dataSize)\n        }\n    }\n\n    function requiredGas(uint256 relayedCallStipend) public view returns (uint256) {\n        return gasOverhead + gasReserve + acceptRelayedCallMaxGas + preRelayedCallMaxGas + postRelayedCallMaxGas + relayedCallStipend;\n    }\n\n    function maxPossibleCharge(uint256 relayedCallStipend, uint256 gasPrice, uint256 transactionFee) public view returns (uint256) {\n        return calculateCharge(requiredGas(relayedCallStipend), gasPrice, transactionFee);\n    }\n\n    function calculateCharge(uint256 gas, uint256 gasPrice, uint256 fee) private pure returns (uint256) {\n        // The fee is expressed as a percentage. E.g. a value of 40 stands for a 40% fee, so the recipient will be\n        // charged for 1.4 times the spent amount.\n        return (gas * gasPrice * (100 + fee)) / 100;\n    }\n\n    function getChargeableGas(uint256 gasUsed, bool postRelayedCallEstimation) private pure returns (uint256) {\n        return gasOverhead + gasUsed + (postRelayedCallEstimation ? (postRelayedCallMaxGas + recipientCallsAtomicOverhead) : 0);\n    }\n\n    struct Transaction {\n        uint256 nonce;\n        uint256 gasPrice;\n        uint256 gasLimit;\n        address to;\n        uint256 value;\n        bytes data;\n    }\n\n    function decodeTransaction(bytes memory rawTransaction) private pure returns (Transaction memory transaction) {\n        (transaction.nonce, transaction.gasPrice, transaction.gasLimit, transaction.to, transaction.value, transaction.data) = RLPReader.decodeTransaction(rawTransaction);\n        return transaction;\n\n    }\n\n    function penalizeRepeatedNonce(bytes memory unsignedTx1, bytes memory signature1, bytes memory unsignedTx2, bytes memory signature2) public {\n        // Can be called by anyone.\n        // If a relay attacked the system by signing multiple transactions with the same nonce (so only one is accepted), anyone can grab both transactions from the blockchain and submit them here.\n        // Check whether unsignedTx1 != unsignedTx2, that both are signed by the same address, and that unsignedTx1.nonce == unsignedTx2.nonce.  If all conditions are met, relay is considered an \"offending relay\".\n        // The offending relay will be unregistered immediately, its stake will be forfeited and given to the address who reported it (msg.sender), thus incentivizing anyone to report offending relays.\n        // If reported via a relay, the forfeited stake is split between msg.sender (the relay used for reporting) and the address that reported it.\n\n        address addr1 = keccak256(abi.encodePacked(unsignedTx1)).recover(signature1);\n        address addr2 = keccak256(abi.encodePacked(unsignedTx2)).recover(signature2);\n\n        require(addr1 == addr2, \"Different signer\");\n\n        Transaction memory decodedTx1 = decodeTransaction(unsignedTx1);\n        Transaction memory decodedTx2 = decodeTransaction(unsignedTx2);\n\n        //checking that the same nonce is used in both transaction, with both signed by the same address and the actual data is different\n        // note: we compare the hash of the tx to save gas over iterating both byte arrays\n        require(decodedTx1.nonce == decodedTx2.nonce, \"Different nonce\");\n\n        bytes memory dataToCheck1 = abi.encodePacked(decodedTx1.data, decodedTx1.gasLimit, decodedTx1.to, decodedTx1.value);\n        bytes memory dataToCheck2 = abi.encodePacked(decodedTx2.data, decodedTx2.gasLimit, decodedTx2.to, decodedTx2.value);\n        require(keccak256(dataToCheck1) != keccak256(dataToCheck2), \"tx is equal\");\n\n        penalize(addr1);\n    }\n\n    function penalizeIllegalTransaction(bytes memory unsignedTx, bytes memory signature) public {\n        Transaction memory decodedTx = decodeTransaction(unsignedTx);\n        if (decodedTx.to == address(this)) {\n            bytes4 selector = GsnUtils.getMethodSig(decodedTx.data);\n            // Note: If RelayHub's relay API is extended, the selectors must be added to the ones listed here\n            require(selector != this.relayCall.selector && selector != this.registerRelay.selector, \"Legal relay transaction\");\n        }\n\n        address relay = keccak256(abi.encodePacked(unsignedTx)).recover(signature);\n\n        penalize(relay);\n    }\n\n    function penalize(address relay) private {\n        require((relays[relay].state == RelayState.Staked) ||\n        (relays[relay].state == RelayState.Registered) ||\n            (relays[relay].state == RelayState.Removed), \"Unstaked relay\");\n\n        // Half of the stake will be burned (sent to address 0)\n        uint256 totalStake = relays[relay].stake;\n        uint256 toBurn = SafeMath.div(totalStake, 2);\n        uint256 reward = SafeMath.sub(totalStake, toBurn);\n\n        if (relays[relay].state == RelayState.Registered) {\n            emit RelayRemoved(relay, now);\n        }\n\n        // The relay is deleted\n        delete relays[relay];\n\n        // Ether is burned and transferred\n        address(0).transfer(toBurn);\n        address payable reporter = msg.sender;\n        reporter.transfer(reward);\n\n        emit Penalized(relay, reporter, reward);\n    }\n}\n",
      "file": "RelayHub.sol"
    }
  ],
  "libraries": {},
  "creationData": {
    "blockHash": "0x2ae5738a3b7eae99246e41e38441dde6b13b9ecd500985b8a949aa48c9c16166",
    "blockNumber": 290455,
    "transactionHash": "0x2bad8271e60acf4109dc516d4536cdc4f926fe0f9197ce93b2cae7066a1b15a7",
    "timestamp": 1571170230
  }
}